{"https://en.wikipedia.org/wiki/3D_printing":{"ref":[],"source":"http://en.wikipedia.org/wiki/3D_printing","summary":"3D printing, also known as additive manufacturing (AM), refers to processes used to synthesize a three-dimensional object in which successive layers of material are formed under computer control to create an object. Objects can be of almost any shape or geometry and are produced from digital model data 3D model or another electronic data source such as an Additive Manufacturing File (AMF) file.","abstract":"3D printing, also known as additive manufacturing (AM), refers to processes used to synthesize a three-dimensional object in which successive layers of material are formed under computer control to create an object. Objects can be of almost any shape or geometry and are produced from digital model data 3D model or another electronic data source such as an Additive Manufacturing File (AMF) file. Futurologist Jeremy Rifkin claimed that 3D printing or AM signals the beginning of a third industrial revolution, succeeding the production line assembly that dominated manufacturing starting in the late 19th century. The term 3D printing has its origin sense, 3D printing in reference to a process that deposits a binder material onto a powder bed with inkjet printer heads layer by layer. More recently, the term is being used in popular vernacular to encompass a wider variety of additive manufacturing techniques. United States and global Technical standards use the official term additive manufacturing for this broader sense. ISO/ASTM52900-15 defines seven categories of AM processes within its meaning: Binder Jetting, Directed Energy Deposition, Material Extrusion, Material Jetting, Powder Bed Fusion, Sheet Lamination and Vat Photopolymerization.","title":"3D printing"},"https://en.wikipedia.org/wiki/Fused_deposition_modeling":{"ref":[],"abstract":"Fused deposition modeling (FDM) is an additive manufacturing technology commonly used for modeling, prototyping, and production applications. It is one of the techniques used for 3D printing. FDM works on an \"additive\" principle by laying down material in layers; a plastic filament or metal wire is unwound from a coil and supplies material to produce a part. The technology was developed by S. Scott Crump in the late 1980s and was commercialized in 1990. The term fused deposition modeling and its abbreviation to FDM are trademarked by Stratasys Inc. The exactly equivalent term, fused filament fabrication (FFF), was coined by the members of the RepRap project to give a phrase that would be legally unconstrained in its use. It is also sometimes called Plastic Jet Printing (PJP).","source":"http://en.wikipedia.org/wiki/Fused_deposition_modeling","title":"Fused deposition modeling","summary":"Fused deposition modeling (FDM) is an additive manufacturing technology commonly used for modeling, prototyping, and production applications. It is one of the techniques used for 3D printing. FDM works on an \"additive\" principle by laying down material in layers; a plastic filament or metal wire is unwound from a coil and supplies material to produce a part."},"https://en.wikipedia.org/wiki/Stereolithography":{"ref":[],"source":"http://en.wikipedia.org/wiki/Stereolithography","title":"Stereolithography","abstract":"Stereolithography (SLA or SL; also known as stereolithography apparatus, optical fabrication, photo-solidification, or resin printing) is a form of 3-D printing technology used for creating models, prototypes, patterns, and production parts in a layer by layer fashion using photopolymerization, a process by which light causes chains of molecules to link together, forming polymers. Those polymers then make up the body of a three-dimensional solid. Research in the area had been conducted during the 1970s, but the term was coined by Charles (Chuck) W. Hull in 1986 when he patented the process. He then set up 3D Systems Inc to commercialize his patent.","summary":"Stereolithography (SLA or SL; also known as stereolithography apparatus, optical fabrication, photo-solidification, or resin printing) is a form of 3-D printing technology used for creating models, prototypes, patterns, and production parts in a layer by layer fashion using photopolymerization, a process by which light causes chains of molecules to link together, forming polymers. Those polymers then make up the body of a three-dimensional solid. Research in the area had been conducted during the 1970s, but the term was coined by Charles (Chuck) W. Hull in 1986 when he patented the process. He then set up 3D Systems Inc to commercialize his patent."},"https://en.wikipedia.org/wiki/Powder_bed_and_inkjet_head_3D_printing":{"ref":[],"source":"http://en.wikipedia.org/wiki/Powder_bed_and_inkjet_head_3D_printing","summary":"Powder bed and inkjet 3D printing, known variously as \"binder jetting\" and \"drop-on-powder\" – or simply \"3D printing\" (3DP) – is a rapid prototyping and additive manufacturing (or \"layered manufacturing\") technology for making objects described by digital data. (Other \"powder-bed\" manufacturing technologies include selective laser sintering and selective laser melting.)","title":"Powder bed and inkjet head 3D printing","abstract":"Powder bed and inkjet 3D printing, known variously as \"binder jetting\" and \"drop-on-powder\" – or simply \"3D printing\" (3DP) – is a rapid prototyping and additive manufacturing (or \"layered manufacturing\") technology for making objects described by digital data. (Other \"powder-bed\" manufacturing technologies include selective laser sintering and selective laser melting.)"},"https://en.wikipedia.org/wiki/Laser_cutting":{"ref":[],"title":"Laser cutting","abstract":"Laser cutting is a technology that uses a laser to cut materials, and is typically used for industrial manufacturing applications, but is also starting to be used by schools, small businesses, and hobbyists. Laser cutting works by directing the output of a high-power laser most commonly through optics. The laser optics and CNC (computer numerical control) are used to direct the material or the laser beam generated. A typical commercial laser for cutting materials would involve a motion control system to follow a CNC or G-code of the pattern to be cut onto the material. The focused laser beam is directed at the material, which then either melts, burns, vaporizes away, or is blown away by a jet of gas, leaving an edge with a high-quality surface finish. Industrial laser cutters are used to cut flat-sheet material as well as structural and piping materials.","source":"http://en.wikipedia.org/wiki/Laser_cutting","summary":"Laser cutting is a technology that uses a laser to cut materials, and is typically used for industrial manufacturing applications, but is also starting to be used by schools, small businesses, and hobbyists. Laser cutting works by directing the output of a high-power laser most commonly through optics. The laser optics and CNC (computer numerical control) are used to direct the material or the laser beam generated. A typical commercial laser for cutting materials would involve a motion control system to follow a CNC or G-code of the pattern to be cut onto the material. The focused laser beam is directed at the material, which then either melts, burns, vaporizes away, or is blown away by a jet of gas, leaving an edge with a high-quality surface finish. Industrial laser cutters are used to c"},"https://en.wikipedia.org/wiki/Selective_laser_sintering":{"ref":[],"source":"http://en.wikipedia.org/wiki/Selective_laser_sintering","summary":"Selective laser sintering (SLS) is an additive manufacturing (AM) technique that uses a laser as the power source to sinter powdered material (typically metal), aiming the laser automatically at points in space defined by a 3D model, binding the material together to create a solid structure. It is similar to direct metal laser sintering (DMLS); the two are instantiations of the same concept but differ in technical details. Selective laser melting (SLM) uses a comparable concept, but in SLM the material is fully melted rather than sintered, allowing different properties (crystal structure, porosity, and so on). SLS (as well as the other mentioned AM techniques) is a relatively new technology that so far has mainly been used for rapid prototyping and for low-volume production of component pa","abstract":"Selective laser sintering (SLS) is an additive manufacturing (AM) technique that uses a laser as the power source to sinter powdered material (typically metal), aiming the laser automatically at points in space defined by a 3D model, binding the material together to create a solid structure. It is similar to direct metal laser sintering (DMLS); the two are instantiations of the same concept but differ in technical details. Selective laser melting (SLM) uses a comparable concept, but in SLM the material is fully melted rather than sintered, allowing different properties (crystal structure, porosity, and so on). SLS (as well as the other mentioned AM techniques) is a relatively new technology that so far has mainly been used for rapid prototyping and for low-volume production of component parts. Production roles are expanding as the commercialization of AM technology improves.","title":"Selective laser sintering"},"https://en.wikipedia.org/wiki/Selective_laser_melting":{"ref":[],"abstract":"Selective laser melting is an additive manufacturing process that uses 3D CAD data as a digital information source and energy in the form of a high-power laser beam, to create three-dimensional metal parts by fusing fine metal powders together. Manufacturing applications in aerospace or medical orthopedics are being pioneered.","summary":"Selective laser melting is an additive manufacturing process that uses 3D CAD data as a digital information source and energy in the form of a high-power laser beam, to create three-dimensional metal parts by fusing fine metal powders together. Manufacturing applications in aerospace or medical orthopedics are being pioneered.","source":"http://en.wikipedia.org/wiki/Selective_laser_melting","title":"Selective laser melting"},"https://en.wikipedia.org/wiki/Numerical_control":{"ref":[],"abstract":"Computer Numeric Control (CNC) is the automation of machine tools that are operated by precisely programmed commands encoded on a storage medium (computer command module, usually located on the device) as opposed to controlled manually by hand wheels or levers, or mechanically automated by cams alone. Most NC today is computer (or computerized) numerical control (CNC), in which computers play an integral part of the control. In modern CNC systems, end-to-end component design is highly automated using computer-aided design (CAD) and computer-aided manufacturing (CAM) programs. The programs produce a computer file that is interpreted to extract the commands needed to operate a particular machine by use of a post processor, and then loaded into the CNC machines for production. Since any particular component might require the use of a number of different tools – drills, saws, etc. – modern machines often combine multiple tools into a single \"cell\". In other installations, a number of different machines are used with an external controller and human or robotic operators that move the component from machine to machine. In either case, the series of steps needed to produce any part is highly automated and produces a part that closely matches the original CAD design.","source":"http://en.wikipedia.org/wiki/Numerical_control","summary":"Computer Numeric Control (CNC) is the automation of machine tools that are operated by precisely programmed commands encoded on a storage medium (computer command module, usually located on the device) as opposed to controlled manually by hand wheels or levers, or mechanically automated by cams alone. Most NC today is computer (or computerized) numerical control (CNC), in which computers play an integral part of the control.","title":"Numerical control"},"https://en.wikipedia.org/wiki/Version_control":{"ref":[],"summary":"A component of software configuration management, version control, also known as revision control or source control, is the management of changes to documents, computer programs, large web sites, and other collections of information. Changes are usually identified by a number or letter code, termed the \"revision number\", \"revision level\", or simply \"revision\". For example, an initial set of files is \"revision 1\". When the first change is made, the resulting set is \"revision 2\", and so on. Each revision is associated with a timestamp and the person making the change. Revisions can be compared, restored, and with some types of files, merged.","abstract":"A component of software configuration management, version control, also known as revision control or source control, is the management of changes to documents, computer programs, large web sites, and other collections of information. Changes are usually identified by a number or letter code, termed the \"revision number\", \"revision level\", or simply \"revision\". For example, an initial set of files is \"revision 1\". When the first change is made, the resulting set is \"revision 2\", and so on. Each revision is associated with a timestamp and the person making the change. Revisions can be compared, restored, and with some types of files, merged. The need for a logical way to organize and control revisions has existed for almost as long as writing has existed, but revision control became much more important, and complicated, when the era of computing began. The numbering of book editions and of specification revisions are examples that date back to the print-only era. Today, the most capable (as well as complex) revision control systems are those used in software development, where a team of people may change the same files. Version control systems (VCS) most commonly run as stand-alone applications, but revision control is also embedded in various types of software such as word processors and spreadsheets, collaborative web docs and in various content management systems, e.g., Wikipedia's Page history. Revision control allows for the ability to revert a document to a previous revision, which is critical for allowing editors to track each other's edits, correct mistakes, and defend against vandalism and spamming. Software tools for revision control are essential for the organization of multi-developer projects.","title":"Version control","source":"http://en.wikipedia.org/wiki/Version_control"},"https://en.wikipedia.org/wiki/Virtual_touch_screen":{"ref":[],"abstract":"A virtual touch screen (VTS) is a user interface system that augments virtual objects into reality either through a projector or optical display using sensors to track a person's interaction with the object. For instance, using a display and a rear projector system a person could create images that look three-dimensional and appear to float in midair. Some systems utilize an optical head-mounted display to augment the virtual objects onto the transparent display utilizing sensors to determine visual and physical interactions with the virtual objects projected.","source":"http://en.wikipedia.org/wiki/Virtual_touch_screen","title":"Virtual touch screen","summary":"A virtual touch screen (VTS) is a user interface system that augments virtual objects into reality either through a projector or optical display using sensors to track a person's interaction with the object. For instance, using a display and a rear projector system a person could create images that look three-dimensional and appear to float in midair. Some systems utilize an optical head-mounted display to augment the virtual objects onto the transparent display utilizing sensors to determine visual and physical interactions with the virtual objects projected."},"https://en.wikipedia.org/wiki/Blog":{"ref":[],"source":"http://en.wikipedia.org/wiki/Blog","abstract":"A blog (a truncation of the expression weblog) is a discussion or informational website published on the World Wide Web consisting of discrete, often informal diary-style text entries (\"posts\"). Posts are typically displayed in reverse chronological order, so that the most recent post appears first, at the top of the web page. Until 2009, blogs were usually the work of a single individual, occasionally of a small group, and often covered a single subject or topic. In the 2010s, \"multi-author blogs\" (MABs) have developed, with posts written by large numbers of authors and sometimes professionally edited. MABs from newspapers, other media outlets, universities, think tanks, advocacy groups, and similar institutions account for an increasing quantity of blog traffic. The rise of Twitter and other \"microblogging\" systems helps integrate MABs and single-author blogs into the news media. Blog can also be used as a verb, meaning to maintain or add content to a blog. The emergence and growth of blogs in the late 1990s coincided with the advent of web publishing tools that facilitated the posting of content by non-technical users who did not have much experience with HTML or computer programming. Previously, a knowledge of such technologies as HTML and File Transfer Protocol had been required to publish content on the Web, and as such, early Web users tended to be hackers and computer enthusiasts. In the 2010s, majority are interactive Web 2.0 websites, allowing visitors to leave online comments and even message each other via GUI widgets on the blogs, and it is this interactivity that distinguishes them from other static websites. In that sense, blogging can be seen as a form of social networking service. Indeed, bloggers do not only produce content to post on their blogs, but also build social relations with their readers and other bloggers. However, there are high-readership blogs which do not allow comments. Many blogs provide commentary on a particular subject or topic, ranging from politics to sports. Others function as more personal online diaries, and others function more as online brand advertising of a particular individual or company. A typical blog combines text, digital images, and links to other blogs, web pages, and other media related to its topic. The ability of readers to leave comments in an interactive format is an important contribution to the popularity of many blogs. However, blog owners or authors need to moderate and filter online comments to remove hate speech or other offensive content. Most blogs are primarily textual, although some focus on art (art blogs), photographs (photoblogs), videos (video blogs or \"vlogs\"), music (MP3 blogs), and audio (podcasts). Microblogging is another type of blogging, featuring very short posts. In education, blogs can be used as instructional resources. These blogs are referred to as edublogs. On 16 February 2011, there were over 156 million public blogs in existence.On 20 February 2014, there were around 172 million Tumblr and 75.8 million WordPress blogs in existence worldwide. According to critics and other bloggers, Blogger is the most popular blogging service used today. However, Blogger does not offer public statistics. Technorati has 1.3 million blogs as of February 22, 2014.","title":"Blog","summary":"A blog (a truncation of the expression weblog) is a discussion or informational website published on the World Wide Web consisting of discrete, often informal diary-style text entries (\"posts\"). Posts are typically displayed in reverse chronological order, so that the most recent post appears first, at the top of the web page. Until 2009, blogs were usually the work of a single individual, occasionally of a small group, and often covered a single subject or topic. In the 2010s, \"multi-author blogs\" (MABs) have developed, with posts written by large numbers of authors and sometimes professionally edited. MABs from newspapers, other media outlets, universities, think tanks, advocacy groups, and similar institutions account for an increasing quantity of blog traffic. The rise of Twitter and o"},"https://en.wikipedia.org/wiki/Company_register":{"ref":[],"abstract":"A company register is a register of organizations in the jurisdiction they operate under. A statistical business register has a different purpose than a company register. While commercial/trade register serves a purpose of protection, accountability and control, a statistical register plays a central part in a system of official economic statistics at a national statistics office.","title":"Company register","source":"http://en.wikipedia.org/wiki/Company_register","summary":"A company register is a register of organizations in the jurisdiction they operate under. A statistical business register has a different purpose than a company register. While commercial/trade register serves a purpose of protection, accountability and control, a statistical register plays a central part in a system of official economic statistics at a national statistics office."},"https://en.wikipedia.org/wiki/Video_hosting_service":{"ref":[],"abstract":"A video hosting service allows individual end users to upload and share personal, business, or royalty-free videos and to watch them legally. Users generally will upload via the hosting service's website, mobile or desktop applications or APIs. The type of video content uploaded can be anything from short video clips and digital audio files all the way to full-length TV shows and movies. The video host stores the video on its server offers individual different types of embed codes or links to allow others to view this video. The website, mainly used as the video hosting website, is usually called the video sharing website. Some video hosting services offer copyrighted TV shows, movies and music for which they have not obtained the necessary copyright approvals.","title":"Video hosting service","source":"http://en.wikipedia.org/wiki/Video_hosting_service","summary":"A video hosting service allows individual end users to upload and share personal, business, or royalty-free videos and to watch them legally. Users generally will upload via the hosting service's website, mobile or desktop applications or APIs. The type of video content uploaded can be anything from short video clips and digital audio files all the way to full-length TV shows and movies. The video host stores the video on its server offers individual different types of embed codes or links to allow others to view this video. The website, mainly used as the video hosting website, is usually called the video sharing website. Some video hosting services offer copyrighted TV shows, movies and music for which they have not obtained the necessary copyright approvals."},"https://en.wikipedia.org/wiki/Image_hosting_service":{"ref":[],"title":"Image hosting service","source":"http://en.wikipedia.org/wiki/Image_hosting_service","abstract":"An image hosting service allows individuals to upload images to an Internet website. The image host will then store the image onto its server, and show the individual different types of code to allow others to view that image.","summary":"An image hosting service allows individuals to upload images to an Internet website. The image host will then store the image onto its server, and show the individual different types of code to allow others to view that image."},"https://en.wikipedia.org/wiki/Streaming_media":{"ref":[],"title":"Streaming media","source":"http://en.wikipedia.org/wiki/Streaming_media","summary":"Streaming media is multimedia that is constantly received by and presented to an end-user while being delivered by a provider. The verb \"to stream\" refers to the process of delivering or obtaining media in this manner; the term refers to the delivery method of the medium, rather than the medium itself, and is an alternative to file downloading, a process in which the end-user obtains the entire file for the content before watching or listening to it.","abstract":"Streaming media is multimedia that is constantly received by and presented to an end-user while being delivered by a provider. The verb \"to stream\" refers to the process of delivering or obtaining media in this manner; the term refers to the delivery method of the medium, rather than the medium itself, and is an alternative to file downloading, a process in which the end-user obtains the entire file for the content before watching or listening to it. A client end-user can use their media player to begin to play the data file (such as a digital file of a movie or song) before the entire file has been transmitted. Distinguishing delivery method from the media distributed applies specifically to telecommunications networks, as most of the delivery systems are either inherently streaming (e.g. radio, television) or inherently non-streaming (e.g. books, video cassettes, audio CDs). For example, in the 1930s, elevator music was among the earliest popularly available streaming media; nowadays Internet television is a common form of streamed media. The term \"streaming media\" can apply to media other than video and audio such as live closed captioning, ticker tape, and real-time text, which are all considered \"streaming text\". The term \"streaming\" was first used in the early 1990s as a better description for video on demand on IP networks; at the time such video was usually referred to as \"store and forward video\", which was misleading nomenclature. As of 2016, streaming is generally taken to refer to cases where a user watches digital video content and/or listens to digital audio content on a computer screen and speakers (ranging from a desktop computer to a smartphone) over the Internet. With streaming content, the user does not have to download the entire digital video or digital audio file before they start to watch/listen to it. There are challenges with streaming content on the Internet. If the user does not have enough bandwidth in their Internet connection, they may experience stops in the content and some users may not be able to stream certain content due to not having compatible computer or software systems. As of 2016, two popular streaming services are the video sharing website YouTube, which contains video and audio files on a huge range of topics and Netflix, which streams movies and TV shows. Live streaming refers to Internet content delivered in real-time, as events happen, much as live television broadcasts its contents over the airwaves via a television signal. An example of live streaming is Metropolitan Opera Live in HD, a program in which the Metropolitan Opera streams an opera performance \"live\", as the performance is taking place; in 2013–2014, 10 operas were transmitted via satellite into at least 2,000 theaters in 66 countries. Live internet streaming requires a form of source media (e.g. a video camera, an audio interface, screen capture software), an encoder to digitize the content, a media publisher, and a content delivery network to distribute and deliver the content. Live streaming does not need to be recorded at the origination point, although it frequently is."},"https://en.wikipedia.org/wiki/Massive_open_online_course":{"ref":[],"summary":"A Massive Open Online Course (MOOC /muːk/) is an online course aimed at unlimited participation and open access via the web. In addition to traditional course materials such as filmed lectures, readings, and problem sets, many MOOCs provide interactive user forums to support community interactions among students, professors, and teaching assistants (TAs). MOOCs are a recent and widely researched development in distance education which were first introduced in 2008 and emerged as a popular mode of learning in 2012.","source":"http://en.wikipedia.org/wiki/Massive_open_online_course","abstract":"A Massive Open Online Course (MOOC /muːk/) is an online course aimed at unlimited participation and open access via the web. In addition to traditional course materials such as filmed lectures, readings, and problem sets, many MOOCs provide interactive user forums to support community interactions among students, professors, and teaching assistants (TAs). MOOCs are a recent and widely researched development in distance education which were first introduced in 2008 and emerged as a popular mode of learning in 2012. Early MOOCs often emphasized open-access features, such as open licensing of content, structure and learning goals, to promote the reuse and remixing of resources. Some later MOOCs use closed licenses for their course materials while maintaining free access for students. Robert Zemsky (2014) argues that they have passed their peak: \"They came; they conquered very little; and now they face substantially diminished prospects.\" Others have pointed to a backlash arising from the tiny completion rates.","title":"Massive open online course"},"https://en.wikipedia.org/wiki/Podcast":{"ref":[],"summary":"A podcast is an episodic series of digital media files which a user can set up so that new episodes are automatically downloaded via web syndication to the user's own local computer or portable media player. The word arose as a portmanteau of \"iPod\" (a brand of media player) and \"broadcast\". Thus, the files distributed are typically in audio or video formats, but may sometimes include other file formats such as PDF or ePub.","abstract":"A podcast is an episodic series of digital media files which a user can set up so that new episodes are automatically downloaded via web syndication to the user's own local computer or portable media player. The word arose as a portmanteau of \"iPod\" (a brand of media player) and \"broadcast\". Thus, the files distributed are typically in audio or video formats, but may sometimes include other file formats such as PDF or ePub. The distributor of a podcast maintains a central list of the files on a server as a web feed that can be accessed through the Internet. The listener or viewer uses special client application software on a computer or media player, known as a podcatcher, which accesses this web feed, checks it for updates, and downloads any new files in the series. This process can be automated so that new files are downloaded automatically, which may seem to the user as though new episodes are broadcast or \"pushed\" to them. Files are stored locally on the user's device, ready for offline use. Podcasting contrasts with webcasting or streaming which do not allow for offline listening, although most podcasts may also be streamed on demand as an alternative to download. Many podcast players (apps as well as dedicated devices) allow listeners to adjust the playback speed. Some have labeled podcasting as a converged medium bringing together audio, the web, and portable media players, as well as a disruptive technology that has caused some people in the radio business to reconsider established practices and preconceptions about audiences, consumption, production, and distribution. Podcasts are usually free of charge to listeners and can often be created for little to no cost, which sets them apart from the traditional model of \"gate-kept\" media and production tools. It is very much a horizontal media form: producers are consumers, consumers may become producers, and both can engage in conversations with each other.","title":"Podcast","source":"http://en.wikipedia.org/wiki/Podcast"},"https://en.wikipedia.org/wiki/Crowdfunding":{"ref":[],"summary":"Crowdfunding is the practice of funding a project or venture by raising monetary contributions from a large number of people. Crowdfunding is a form of crowdsourcing and of alternative finance. In 2015, it was estimated that worldwide over US$34 billion was raised this way. Crowdfunding has been used to fund a wide range for-profit entrepreneurial ventures such as artistic and creative projects, medical expenses, travel, or community-oriented social entrepreneurship projects.","source":"http://en.wikipedia.org/wiki/Crowdfunding","abstract":"Crowdfunding is the practice of funding a project or venture by raising monetary contributions from a large number of people. Crowdfunding is a form of crowdsourcing and of alternative finance. In 2015, it was estimated that worldwide over US$34 billion was raised this way. Although the concept can also be executed through mail-order subscriptions, benefit events, and other methods, it is now often performed via Internet-mediated registries. This modern crowdfunding model is generally based on three types of actors: the project initiator who proposes the idea and/or project to be funded, individuals or groups who support the idea, and a moderating organization (the \"platform\") that brings the parties together to launch the idea. Crowdfunding has been used to fund a wide range for-profit entrepreneurial ventures such as artistic and creative projects, medical expenses, travel, or community-oriented social entrepreneurship projects.","title":"Crowdfunding"},"https://en.wikipedia.org/wiki/Equity_crowdfunding":{"ref":[],"abstract":"Equity crowdfunding is the online offering of private company securities to a group of people for investment. Because equity crowdfunding involves investment into a commercial enterprise, it is often subject to securities and financial regulation. Equity crowdfunding is also referred to as crowdinvesting, investment crowdfunding, or crowd equity. Equity crowdfunding is a mechanism that enables broad groups of investors to fund startup companies and small businesses in return for equity. Investors give money to a business and receive ownership of a small piece of that business. If the business succeeds, then its value goes up, as well as the value of a share in that business—the converse is also true. Coverage of equity crowdfunding indicates that its potential is greatest with startup businesses that are seeking smaller investments to achieve establishment, while follow-on funding (required for subsequent growth) may come from other sources.","title":"Equity crowdfunding","summary":"Equity crowdfunding is the online offering of private company securities to a group of people for investment. Because equity crowdfunding involves investment into a commercial enterprise, it is often subject to securities and financial regulation. Equity crowdfunding is also referred to as crowdinvesting, investment crowdfunding, or crowd equity.","source":"http://en.wikipedia.org/wiki/Equity_crowdfunding"},"https://en.wikipedia.org/wiki/Virtual_reality":{"ref":[],"source":"http://en.wikipedia.org/wiki/Virtual_reality","abstract":"Virtual reality (VR) typically refers to computer technologies that use software to generate realistic images, sounds and other sensations that replicate a real environment (or create an imaginary setting), and simulate a user's physical presence in this environment, by enabling the user to interact with this space and any objects depicted therein using specialized display screens or projectors and other devices. VR has been defined as \"...a realistic and immersive simulation of a three-dimensional environment, created using interactive software and hardware, and experienced or controlled by movement of the body\" or as an \"immersive, interactive experience generated by a computer\". A person using virtual reality equipment is typically able to \"look around\" the artificial world, move about in it and interact with features or items that are depicted on a screen or in goggles. Virtual realities artificially create sensory experiences, which can include sight, touch, hearing, and, less commonly, smell. Most 2016-era virtual realities are displayed either on a computer monitor, a projector screen, or with a virtual reality headset (also called head-mounted display or HMD). HMDs typically take the form of head-mounted goggles with a screen in front of the eyes. Some simulations include additional sensory information and provide sounds through speakers or headphones.Virtual Reality actually brings the user into the digital world by cutting off outside stimuli. In this way user is solely focusing on the digital content. Some advanced haptic systems in the 2010s now include tactile information, generally known as force feedback in medical, video gaming and military training applications. Some VR systems used in video games can transmit vibrations and other sensations to the user via the game controller. Virtual reality also refers to remote communication environments which provide a virtual presence of users with through telepresence and telexistence or the use of a virtual artifact (VA), either through the use of standard input devices such as a keyboard and mouse, or through multimodal devices such as a wired glove or omnidirectional treadmills. The immersive environment can be similar to the real world in order to create a lifelike experience—for example, in simulations for pilot or combat training, which depict realistic images and sounds of the world, where the normal laws of physics apply (e.g., in flight simulators), or it can differ significantly from reality, such as in VR video games that take place in fantasy settings, where gamers can use fictional magic and telekinesis powers.","title":"Virtual reality","summary":"Virtual reality (VR) typically refers to computer technologies that use software to generate realistic images, sounds and other sensations that replicate a real environment (or create an imaginary setting), and simulate a user's physical presence in this environment, by enabling the user to interact with this space and any objects depicted therein using specialized display screens or projectors and other devices. VR has been defined as \"...a realistic and immersive simulation of a three-dimensional environment, created using interactive software and hardware, and experienced or controlled by movement of the body\" or as an \"immersive, interactive experience generated by a computer\". A person using virtual reality equipment is typically able to \"look around\" the artificial world, move about "},"https://en.wikipedia.org/wiki/Augmented_reality":{"ref":[],"summary":"Augmented reality (AR) is a live direct or indirect view of a physical, real-world environment whose elements are augmented (or supplemented) by computer-generated sensory input such as sound, video, graphics or GPS data. It is related to a more general concept called mediated reality, in which a view of reality is modified (possibly even diminished rather than augmented) by a computer. As a result, the technology functions by enhancing one’s current perception of reality. By contrast, virtual reality replaces the real world with a simulated one. Augmentation is conventionally in real-time and in semantic context with environmental elements, such as sports scores on TV during a match. With the help of advanced AR technology (e.g. adding computer vision and object recognition) the informati","source":"http://en.wikipedia.org/wiki/Augmented_reality","abstract":"Augmented reality (AR) is a live direct or indirect view of a physical, real-world environment whose elements are augmented (or supplemented) by computer-generated sensory input such as sound, video, graphics or GPS data. It is related to a more general concept called mediated reality, in which a view of reality is modified (possibly even diminished rather than augmented) by a computer. As a result, the technology functions by enhancing one’s current perception of reality. By contrast, virtual reality replaces the real world with a simulated one. Augmentation is conventionally in real-time and in semantic context with environmental elements, such as sports scores on TV during a match. With the help of advanced AR technology (e.g. adding computer vision and object recognition) the information about the surrounding real world of the user becomes interactive and digitally manipulable. Information about the environment and its objects is overlaid on the real world. This information can be virtual or real, e.g. seeing other real sensed or measured information such as electromagnetic radio waves overlaid in exact alignment with where they actually are in space.Augmented reality basically brings out the components of the Digital world into our perceived Real world. Daqri is an company that works on AR products. The best example of AR is their new AR Helmet for contruction workers. This helmet displays essential information about the construction sites to help the workers.","title":"Augmented reality"},"https://en.wikipedia.org/wiki/Blockchain":{"ref":[],"source":"http://en.wikipedia.org/wiki/Blockchain","title":"Blockchain"},"https://en.wikipedia.org/wiki/Smart_contract":{"ref":[],"abstract":"Smart contracts are computer protocols that facilitate, verify, or enforce the negotiation or performance of a contract, or that make a contractual clause unnecessary. Smart contracts usually also have a user interface and often emulate the logic of contractual clauses. Proponents of smart contracts claim that many kinds of contractual clauses may thus be made partially or fully self-executing, self-enforcing, or both. Smart contracts aim to provide security superior to traditional contract law and to reduce other transaction costs associated with contracting.","summary":"Smart contracts are computer protocols that facilitate, verify, or enforce the negotiation or performance of a contract, or that make a contractual clause unnecessary. Smart contracts usually also have a user interface and often emulate the logic of contractual clauses. Proponents of smart contracts claim that many kinds of contractual clauses may thus be made partially or fully self-executing, self-enforcing, or both. Smart contracts aim to provide security superior to traditional contract law and to reduce other transaction costs associated with contracting.","title":"Smart contract","source":"http://en.wikipedia.org/wiki/Smart_contract"},"https://en.wikipedia.org/wiki/Visual_programming_language":{"ref":[],"title":"Visual programming language","source":"http://en.wikipedia.org/wiki/Visual_programming_language","summary":"In computing, a visual programming language (VPL) is any programming language that lets users create programs by manipulating program elements graphically rather than by specifying them textually. A VPL allows programming with visual expressions, spatial arrangements of text and graphic symbols, used either as elements of syntax or secondary notation. For example, many VPLs (known as dataflow or diagrammatic programming) are based on the idea of \"boxes and arrows\", where boxes or other screen objects are treated as entities, connected by arrows, lines or arcs which represent relations.","abstract":"In computing, a visual programming language (VPL) is any programming language that lets users create programs by manipulating program elements graphically rather than by specifying them textually. A VPL allows programming with visual expressions, spatial arrangements of text and graphic symbols, used either as elements of syntax or secondary notation. For example, many VPLs (known as dataflow or diagrammatic programming) are based on the idea of \"boxes and arrows\", where boxes or other screen objects are treated as entities, connected by arrows, lines or arcs which represent relations."},"https://en.wikipedia.org/wiki/Dataflow_programming":{"ref":[],"source":"http://en.wikipedia.org/wiki/Dataflow_programming","abstract":"In computer programming, dataflow programming is a programming paradigm that models a program as a directed graph of the data flowing between operations, thus implementing dataflow principles and architecture. Dataflow programming languages share some features of functional languages, and were generally developed in order to bring some functional concepts to a language more suitable for numeric processing. Some authors use the term Datastream instead of Dataflow to avoid confusion with Dataflow Computing or Dataflow architecture, based on an indeterministic machine paradigm. Dataflow programming was pioneered by Jack Dennis and his graduate students at MIT in the 1960s.","summary":"In computer programming, dataflow programming is a programming paradigm that models a program as a directed graph of the data flowing between operations, thus implementing dataflow principles and architecture. Dataflow programming languages share some features of functional languages, and were generally developed in order to bring some functional concepts to a language more suitable for numeric processing. Some authors use the term Datastream instead of Dataflow to avoid confusion with Dataflow Computing or Dataflow architecture, based on an indeterministic machine paradigm. Dataflow programming was pioneered by Jack Dennis and his graduate students at MIT in the 1960s.","title":"Dataflow programming"},"https://en.wikipedia.org/wiki/3D_modeling":{"ref":[],"title":"3D modeling","source":"http://en.wikipedia.org/wiki/3D_modeling","abstract":"In 3D computer graphics, 3D modeling (or three-dimensional modeling) is the process of developing a mathematical representation of any three-dimensional surface of an object (either inanimate or living) via specialized software. The product is called a 3D model. It can be displayed as a two-dimensional image through a process called 3D rendering or used in a computer simulation of physical phenomena. The model can also be physically created using 3D printing devices. Models may be created automatically or manually. The manual modeling process of preparing geometric data for 3D computer graphics is similar to plastic arts such as sculpting. 3D modeling software is a class of 3D computer graphics software used to produce 3D models. Individual programs of this class are called modeling applications or modelers.","summary":"In 3D computer graphics, 3D modeling (or three-dimensional modeling) is the process of developing a mathematical representation of any three-dimensional surface of an object (either inanimate or living) via specialized software. The product is called a 3D model. It can be displayed as a two-dimensional image through a process called 3D rendering or used in a computer simulation of physical phenomena. The model can also be physically created using 3D printing devices."},"https://en.wikipedia.org/wiki/Mixed_reality":{"ref":[],"summary":"Mixed reality (MR), sometimes referred to as hybrid reality, is the merging of real and virtual worlds to produce new environments and visualizations where physical and digital objects co-exist and interact in real time. Mixed reality takes place not only in the physical world or the virtual world, but is a mix of reality and virtual reality, encompassing both augmented reality and augmented virtuality.","title":"Mixed reality","abstract":"Mixed reality (MR), sometimes referred to as hybrid reality, is the merging of real and virtual worlds to produce new environments and visualizations where physical and digital objects co-exist and interact in real time. Mixed reality takes place not only in the physical world or the virtual world, but is a mix of reality and virtual reality, encompassing both augmented reality and augmented virtuality.","source":"http://en.wikipedia.org/wiki/Mixed_reality"},"https://en.wikipedia.org/wiki/Gesture_recognition":{"ref":[],"source":"http://en.wikipedia.org/wiki/Gesture_recognition","summary":"Gesture recognition is a topic in computer science and language technology with the goal of interpreting human gestures via mathematical algorithms. Gestures can originate from any bodily motion or state but commonly originate from the face or hand. Current focuses in the field include emotion recognition from face and hand gesture recognition.Users can use simple gestures to control or interact with devices without physically touching them. Many approaches have been made using cameras and computer vision algorithms to interpret sign language. However, the identification and recognition of posture, gait, proxemics, and human behaviors is also the subject of gesture recognition techniques.Gesture recognition can be seen as a way for computers to begin to understand human body language, thus","abstract":"Gesture recognition is a topic in computer science and language technology with the goal of interpreting human gestures via mathematical algorithms. Gestures can originate from any bodily motion or state but commonly originate from the face or hand. Current focuses in the field include emotion recognition from face and hand gesture recognition.Users can use simple gestures to control or interact with devices without physically touching them. Many approaches have been made using cameras and computer vision algorithms to interpret sign language. However, the identification and recognition of posture, gait, proxemics, and human behaviors is also the subject of gesture recognition techniques.Gesture recognition can be seen as a way for computers to begin to understand human body language, thus building a richer bridge between machines and humans than primitive text user interfaces or even GUIs (graphical user interfaces), which still limit the majority of input to keyboard and mouse. Gesture recognition enables humans to communicate with the machine (HMI) and interact naturally without any mechanical devices. Using the concept of gesture recognition, it is possible to point a finger at the computer screen so that the cursor will move accordingly. This could potentially make conventional input devices such as mouse, keyboards and even touch-screens redundant. Gesture Recognition Features: \n* More Accurate  \n* High Stability The major application areas of gesture recognition in the current scenario are: \n* Automotive sector \n* Consumer Electronics sector \n* Transit sector \n* Gaming sector Gesture recognition can be conducted with techniques from computer vision and image processing. The literature includes ongoing work in the computer vision field on capturing gestures or more general human pose and movements by cameras connected to a computer. Gesture recognition and pen computing:Pen computing reduces the hardware impact of a system and also increases the range of physical world objects usable for control beyond traditional digital objects like keyboards and mice. Such implementations could enable a new range of hardware that does not require monitors. This idea may lead to the creation of holographic display. The term gesture recognition has been used to refer more narrowly to non-text-input handwriting symbols, such as inking on a graphics tablet, multi-touch gestures, and mouse gesture recognition. This is computer interaction through the drawing of symbols with a pointing device cursor. (see Pen computing)","title":"Gesture recognition"},"https://en.wikipedia.org/wiki/LPWAN":{"ref":[],"summary":"Low-Power Wide-Area Network (LPWAN) or Low-Power Network (LPN) is a type of wireless telecommunication network designed to allow long range communications at a low bit rate among things (connected objects), such as sensors operated on a battery.","source":"http://en.wikipedia.org/wiki/LPWAN","title":"LPWAN","abstract":"Low-Power Wide-Area Network (LPWAN) or Low-Power Network (LPN) is a type of wireless telecommunication network designed to allow long range communications at a low bit rate among things (connected objects), such as sensors operated on a battery."},"https://en.wikipedia.org/wiki/5G":{"ref":[],"title":"5G","abstract":"5G (5th generation mobile networks or 5th generation wireless systems) denotes the proposed next major phase of mobile telecommunications standards beyond the current 4G/IMT-Advanced standards. Rather than faster peak Internet connection speeds, 5G planning aims at higher capacity than current 4G, allowing higher number of mobile broadband users per area unit, and allowing consumption of higher or unlimited data quantities in gigabyte per month and user. This would make it feasible for a large portion of the population to consume high-quality streaming media many hours per day in their mobile devices, also when out of reach of wifi hotspots. 5G research and development also aims at improved support of machine to machine communication, also known as the Internet of things, aiming at lower cost, lower battery consumption and lower latency than 4G equipment. There is currently no standard for 5G deployments. The Next Generation Mobile Networks Alliance defines the following requirements that a 5G standard should fulfill: \n*  Data rates of tens of megabits per second for tens of thousands of users   \n*  1 Gb per second simultaneously to many workers on the same office floor  \n*  Several hundreds of thousands of simultaneous connections for massive wireless sensor network \n*  Spectral efficiency significantly enhanced compared to 4G  \n*  Coverage improved \n*  Signalling efficiency enhanced \n*  Latency reduced significantly compared to LTE. The Next Generation Mobile Networks Alliance feels that 5G should be rolled out by 2020 to meet business and consumer demands. In addition to providing simply faster speeds, they predict that 5G networks also will need to meet new use cases, such as the Internet of Things (internet connected devices) as well as broadcast-like services and lifeline communication in times of natural disaster. Carriers, chipmakers, OEMS and OSATs, such as Advanced Semiconductor Engineering (ASE), have been gearing up for this next-generation (5G) wireless standard, as mobile systems and base stations will require new and faster application processors, basebands and RF devices. Although updated standards that define capabilities beyond those defined in the current 4G standards are under consideration, those new capabilities have been grouped under the current ITU-T 4G standards. The U.S. Federal Communications Commission (FCC) approved the spectrum for 5G, including the 28 Gigahertz, 37 GHz and 39 GHz bands, on July 14, 2016.","summary":"5G (5th generation mobile networks or 5th generation wireless systems) denotes the proposed next major phase of mobile telecommunications standards beyond the current 4G/IMT-Advanced standards. Rather than faster peak Internet connection speeds, 5G planning aims at higher capacity than current 4G, allowing higher number of mobile broadband users per area unit, and allowing consumption of higher or unlimited data quantities in gigabyte per month and user. This would make it feasible for a large portion of the population to consume high-quality streaming media many hours per day in their mobile devices, also when out of reach of wifi hotspots. 5G research and development also aims at improved support of machine to machine communication, also known as the Internet of things, aiming at lower c","source":"http://en.wikipedia.org/wiki/5G"},"https://en.wikipedia.org/wiki/Platform_as_a_service":{"ref":[],"abstract":"Platform as a service (PaaS) is a category of cloud computing services that provides a platform allowing customers to develop, run, and manage applications without the complexity of building and maintaining the infrastructure typically associated with developing and launching an app. PaaS can be delivered in two ways: as a public cloud service from a provider, where the consumer controls software deployment with minimal configuration options, and the provider provides the networks, servers, storage, OS, 'middleware' (i.e.; java runtime, .net runtime, integration, etc.), database and other services to host the consumer's application; or as a private service (software or appliance) inside the firewall, or as software deployed on a public infrastructure as a service.","source":"http://en.wikipedia.org/wiki/Platform_as_a_service","title":"Platform as a service","summary":"Platform as a service (PaaS) is a category of cloud computing services that provides a platform allowing customers to develop, run, and manage applications without the complexity of building and maintaining the infrastructure typically associated with developing and launching an app. PaaS can be delivered in two ways: as a public cloud service from a provider, where the consumer controls software deployment with minimal configuration options, and the provider provides the networks, servers, storage, OS, 'middleware' (i.e.; java runtime, .net runtime, integration, etc.), database and other services to host the consumer's application; or as a private service (software or appliance) inside the firewall, or as software deployed on a public infrastructure as a service."},"https://en.wikipedia.org/wiki/Software_as_a_service":{"ref":[],"summary":"Software as a service (SaaS; pronounced /sæs/) is a software licensing and delivery model in which software is licensed on a subscription basis and is centrally hosted. It is sometimes referred to as \"on-demand software\". SaaS is typically accessed by users using a thin client via a web browser. SaaS has become a common delivery model for many business applications, including office and messaging software, payroll processing software, DBMS software, management software, CAD software, development software, gamification, virtualization, accounting, collaboration, customer relationship management (CRM), management information systems (MIS), enterprise resource planning (ERP), invoicing, human resource management (HRM), talent acquisition, content management (CM), antivirus software, and servi","abstract":"Software as a service (SaaS; pronounced /sæs/) is a software licensing and delivery model in which software is licensed on a subscription basis and is centrally hosted. It is sometimes referred to as \"on-demand software\". SaaS is typically accessed by users using a thin client via a web browser. SaaS has become a common delivery model for many business applications, including office and messaging software, payroll processing software, DBMS software, management software, CAD software, development software, gamification, virtualization, accounting, collaboration, customer relationship management (CRM), management information systems (MIS), enterprise resource planning (ERP), invoicing, human resource management (HRM), talent acquisition, content management (CM), antivirus software, and service desk management. SaaS has been incorporated into the strategy of nearly all leading enterprise software companies. According to a Gartner Group estimate, SaaS sales in 2010 reached $10 billion and were projected to increase to $12.1bn in 2011, up 20.7% from 2010. Gartner Group estimates that SaaS revenue will be more than double its 2010 numbers by 2015 and reach a projected $21.3bn. Customer relationship management (CRM) continues to be the largest market for SaaS. SaaS revenue within the CRM market was forecast to reach $3.8bn in 2011, up from $3.2bn in 2010. The term \"software as a service\" (SaaS) is considered to be part of the nomenclature of cloud computing, along with infrastructure as a service (IaaS), platform as a service (PaaS), desktop as a service (DaaS), managed software as a service (MSaaS), mobile backend as a service (MBaaS), and information technology management as a service (ITMaaS).","source":"http://en.wikipedia.org/wiki/Software_as_a_service","title":"Software as a service"},"https://en.wikipedia.org/wiki/Peer-to-peer":{"ref":[],"abstract":"Peer-to-peer (P2P) computing or networking is a distributed application architecture that partitions tasks or work loads between peers. Peers are equally privileged, equipotent participants in the application. They are said to form a peer-to-peer network of nodes. Peers make a portion of their resources, such as processing power, disk storage or network bandwidth, directly available to other network participants, without the need for central coordination by servers or stable hosts. Peers are both suppliers and consumers of resources, in contrast to the traditional client-server model in which the consumption and supply of resources is divided. Emerging collaborative P2P systems are going beyond the era of peers doing similar things while sharing resources, and are looking for diverse peers that can bring in unique resources and capabilities to a virtual community thereby empowering it to engage in greater tasks beyond those that can be accomplished by individual peers, yet that are beneficial to all the peers. While P2P systems had previously been used in many application domains, the architecture was popularized by the file sharing system Napster, originally released in 1999. The concept has inspired new structures and philosophies in many areas of human interaction. In such social contexts, peer-to-peer as a meme refers to the egalitarian social networking that has emerged throughout society, enabled by Internet technologies in general.","title":"Peer-to-peer","source":"http://en.wikipedia.org/wiki/Peer-to-peer","summary":"Peer-to-peer (P2P) computing or networking is a distributed application architecture that partitions tasks or work loads between peers. Peers are equally privileged, equipotent participants in the application. They are said to form a peer-to-peer network of nodes."},"https://en.wikipedia.org/wiki/Grid_computing":{"ref":[],"title":"Grid computing","summary":"Grid computing is the collection of computer resources from multiple locations to reach a common goal. The grid can be thought of as a distributed system with non-interactive workloads that involve a large number of files. Grid computing is distinguished from conventional high performance computing systems such as cluster computing in that grid computers have each node set to perform a different task/application. Grid computers also tend to be more heterogeneous and geographically dispersed (thus not physically coupled) than cluster computers. Although a single grid can be dedicated to a particular application, commonly a grid is used for a variety of purposes. Grids are often constructed with general-purpose grid middleware software libraries. Grid sizes can be quite large.","abstract":"Grid computing is the collection of computer resources from multiple locations to reach a common goal. The grid can be thought of as a distributed system with non-interactive workloads that involve a large number of files. Grid computing is distinguished from conventional high performance computing systems such as cluster computing in that grid computers have each node set to perform a different task/application. Grid computers also tend to be more heterogeneous and geographically dispersed (thus not physically coupled) than cluster computers. Although a single grid can be dedicated to a particular application, commonly a grid is used for a variety of purposes. Grids are often constructed with general-purpose grid middleware software libraries. Grid sizes can be quite large. Grids are a form of distributed computing whereby a \"super virtual computer\" is composed of many networked loosely coupled computers acting together to perform large tasks. For certain applications, distributed or grid computing can be seen as a special type of parallel computing that relies on complete computers (with onboard CPUs, storage, power supplies, network interfaces, etc.) connected to a computer network (private or public) by a conventional network interface, such as Ethernet. This is in contrast to the traditional notion of a supercomputer, which has many processors connected by a local high-speed computer bus.","source":"http://en.wikipedia.org/wiki/Grid_computing"},"https://en.wikipedia.org/wiki/Fog_computing":{"ref":[],"summary":"Fog computing or fog networking, also known as fogging, is an architecture that uses one or more collaborative multitude of end-user clients or near-user edge devices to carry out a substantial amount of storage (rather than stored primarily in cloud data centers), communication (rather than routed over the internet backbone), and control, configuration, measurement and management (rather than controlled primarily by network gateways such as those in the LTE core network).","source":"http://en.wikipedia.org/wiki/Fog_computing","title":"Fog computing","abstract":"Fog computing or fog networking, also known as fogging, is an architecture that uses one or more collaborative multitude of end-user clients or near-user edge devices to carry out a substantial amount of storage (rather than stored primarily in cloud data centers), communication (rather than routed over the internet backbone), and control, configuration, measurement and management (rather than controlled primarily by network gateways such as those in the LTE core network)."},"https://en.wikipedia.org/wiki/Cave_automatic_virtual_environment":{"ref":[],"source":"http://en.wikipedia.org/wiki/Cave_automatic_virtual_environment","summary":"A cave automatic virtual environment (better known by the recursive acronym CAVE) is an immersive virtual reality environment where projectors are directed to between three and six of the walls of a room-sized cube. The name is also a reference to the allegory of the Cave in Plato's Republic in which a philosopher contemplates perception, reality and illusion.","abstract":"A cave automatic virtual environment (better known by the recursive acronym CAVE) is an immersive virtual reality environment where projectors are directed to between three and six of the walls of a room-sized cube. The name is also a reference to the allegory of the Cave in Plato's Republic in which a philosopher contemplates perception, reality and illusion.","title":"Cave automatic virtual environment"},"https://en.wikipedia.org/wiki/Peer-to-peer_lending":{"ref":[],"source":"http://en.wikipedia.org/wiki/Peer-to-peer_lending","summary":"Peer-to-peer lending, sometimes abbreviated P2P lending, is the practice of lending money to individuals or businesses through online services that match lenders directly with borrowers. Since the peer-to-peer lending companies offering these services operate entirely online, they can run with lower overhead and provide the service more cheaply than traditional financial institutions. As a result, lenders often earn higher returns compared to savings and investment products offered by banks, while borrowers can borrow money at lower interest rates, even after the P2P lending company has taken a fee for providing the match-making platform and credit checking the borrower.","abstract":"Peer-to-peer lending, sometimes abbreviated P2P lending, is the practice of lending money to individuals or businesses through online services that match lenders directly with borrowers. Since the peer-to-peer lending companies offering these services operate entirely online, they can run with lower overhead and provide the service more cheaply than traditional financial institutions. As a result, lenders often earn higher returns compared to savings and investment products offered by banks, while borrowers can borrow money at lower interest rates, even after the P2P lending company has taken a fee for providing the match-making platform and credit checking the borrower. Also known as crowdlending, many peer-to-peer loans are unsecured personal loans, though some of the largest amounts are lent to businesses. Secured loans are sometimes offered by using luxury assets such as jewelry, watches, vintage cars, fine art, buildings, aircraft and other business assets as collateral. They are made to an individual, company or charity. Other forms of peer-to-peer lending include student loans, commercial and real estate loans, payday loans, as well as secured business loans, leasing, and factoring. The interest rates can be set by lenders who compete for the lowest rate on the reverse auction model or fixed by the intermediary company on the basis of an analysis of the borrower's credit. The lender's investment in the loan is not normally protected by any government guarantee. On some services, lenders mitigate the risk of bad debt by choosing which borrowers to lend to, and mitigate total risk by diversifying their investments among different borrowers. Other models involve the P2P lending company maintaining a separate, ringfenced fund, such as RateSetter's Provision Fund, which pays lenders back in the event the borrower defaults. Bankruptcy of the peer-to-peer lending company that facilitated the loan may also put a lender's investment at risk, as has happened in 2015 in the case of TrustBuddy. The lending intermediaries are for-profit businesses; they generate revenue by collecting a one-time fee on funded loans from borrowers and by assessing a loan servicing fee to investors (tax-disadvantaged in the UK vs charging borrowers) or borrowers (either a fixed amount annually or a percentage of the loan amount). Compared to stock markets, peer-to-peer lending tends to have both less volatility and less liquidity.","title":"Peer-to-peer lending"},"https://en.wikipedia.org/wiki/News_aggregator":{"ref":[],"summary":"In computing, a news aggregator, also termed a feed aggregator, feed reader, news reader, RSS reader or simply aggregator, is client software or a web application which aggregates syndicated web content such as online newspapers, blogs, podcasts, and video blogs (vlogs) in one location for easy viewing. RSS is a synchronized subscription system. Basically, RSS uses extensible markup language (XML) to structure pieces of information to be aggregated in a feed reader that displays the information in a user-friendly interface. The updates distributed include, for example, journal tables of contents, podcasts, videos, and news items.","title":"News aggregator","source":"http://en.wikipedia.org/wiki/News_aggregator","abstract":"In computing, a news aggregator, also termed a feed aggregator, feed reader, news reader, RSS reader or simply aggregator, is client software or a web application which aggregates syndicated web content such as online newspapers, blogs, podcasts, and video blogs (vlogs) in one location for easy viewing. RSS is a synchronized subscription system. Basically, RSS uses extensible markup language (XML) to structure pieces of information to be aggregated in a feed reader that displays the information in a user-friendly interface. The updates distributed include, for example, journal tables of contents, podcasts, videos, and news items."},"https://en.wikipedia.org/wiki/Nanoelectronics":{"ref":[],"summary":"Nanoelectronics refer to the use of nanotechnology in electronic components. The term covers a diverse set of devices and materials, with the common characteristic that they are so small that inter-atomic interactions and quantum mechanical properties need to be studied extensively. Some of these candidates include: hybrid molecular/semiconductor electronics, one-dimensional nanotubes/nanowires, or advanced molecular electronics. Recent silicon CMOS technology generations, such as the 22 nanometer node, are already within this regime. Nanoelectronics are sometimes considered as disruptive technology because present candidates are significantly different from traditional transistors.","source":"http://en.wikipedia.org/wiki/Nanoelectronics","title":"Nanoelectronics","abstract":"Nanoelectronics refer to the use of nanotechnology in electronic components. The term covers a diverse set of devices and materials, with the common characteristic that they are so small that inter-atomic interactions and quantum mechanical properties need to be studied extensively. Some of these candidates include: hybrid molecular/semiconductor electronics, one-dimensional nanotubes/nanowires, or advanced molecular electronics. Recent silicon CMOS technology generations, such as the 22 nanometer node, are already within this regime. Nanoelectronics are sometimes considered as disruptive technology because present candidates are significantly different from traditional transistors."},"https://en.wikipedia.org/wiki/Business_intelligence_software":{"ref":[],"source":"http://en.wikipedia.org/wiki/Business_intelligence_software","abstract":"Business intelligence software is a type of application software designed to retrieve, analyze, transform and report data for business intelligence. The applications generally read data that have been previously stored, often, though not necessarily, in a data warehouse or data mart.","summary":"Business intelligence software is a type of application software designed to retrieve, analyze, transform and report data for business intelligence. The applications generally read data that have been previously stored, often, though not necessarily, in a data warehouse or data mart.","title":"Business intelligence software"},"https://en.wikipedia.org/wiki/Head-mounted_display":{"ref":[],"title":"Head-mounted display","source":"http://en.wikipedia.org/wiki/Head-mounted_display","summary":"A head-mounted display (or helmet-mounted display, for aviation applications), both abbreviated HMD, is a display device, worn on the head or as part of a helmet, that has a small display optic in front of one (monocular HMD) or each eye (binocular HMD). There is also an optical head-mounted display (OHMD), which is a wearable display that can reflect projected images and allows a user to see through it.","abstract":"A head-mounted display (or helmet-mounted display, for aviation applications), both abbreviated HMD, is a display device, worn on the head or as part of a helmet, that has a small display optic in front of one (monocular HMD) or each eye (binocular HMD). There is also an optical head-mounted display (OHMD), which is a wearable display that can reflect projected images and allows a user to see through it."},"https://en.wikipedia.org/wiki/Optical_head-mounted_display":{"ref":[],"source":"http://en.wikipedia.org/wiki/Optical_head-mounted_display","title":"Optical head-mounted display","abstract":"An optical head-mounted display (OHMD) is a wearable device that has the capability of reflecting projected images as well as allowing the user to see through it that is augmented reality.","summary":"An optical head-mounted display (OHMD) is a wearable device that has the capability of reflecting projected images as well as allowing the user to see through it that is augmented reality."},"https://en.wikipedia.org/wiki/Smartglasses":{"ref":[],"abstract":"Smartglasses or smart glasses or Digital Eye Glass or Personal Imaging System are a wearable computer that adds information to what the wearer sees. Typically this is achieved through an optical head-mounted display (OHMD) or computerized internet-connected glasses with transparent heads-up display (HUD) or augmented reality (AR) overlay that has the capability of reflecting projected digital images as well as allowing the user to see through it, or see better with it. While early models can perform basic tasks, such as just serve as a front end display for a remote system, as in the case of smartglasses utilizing cellular technology or Wi-Fi, modern smart glasses are effectively wearable computers which can run self-contained mobile apps. Some are handsfree that can communicate with the Internet via natural language voice commands, while other use touch buttons. Like other computers, smartglasses may collect information from internal or external sensors. It may control, or retrieve data from, other instruments or computers. It may support wireless technologies like Bluetooth, Wi-Fi, and GPS. While a smaller number of models run a mobile operating system and function as portable media players to send audio and video files to the user via a Bluetooth or WiFi headset. Some smartglasses models, also feature full lifelogging and activity tracker capability. Such smartglasses devices may also have all the features of a smartphone. Some also have activity tracker functionality features (also known as \"fitness tracker\") as seen in some GPS watches.","source":"http://en.wikipedia.org/wiki/Smartglasses","title":"Smartglasses","summary":"Smartglasses or smart glasses or Digital Eye Glass or Personal Imaging System are a wearable computer that adds information to what the wearer sees. Typically this is achieved through an optical head-mounted display (OHMD) or computerized internet-connected glasses with transparent heads-up display (HUD) or augmented reality (AR) overlay that has the capability of reflecting projected digital images as well as allowing the user to see through it, or see better with it. While early models can perform basic tasks, such as just serve as a front end display for a remote system, as in the case of smartglasses utilizing cellular technology or Wi-Fi, modern smart glasses are effectively wearable computers which can run self-contained mobile apps. Some are handsfree that can communicate with the I"},"https://en.wikipedia.org/wiki/Speech_recognition":{"ref":[],"summary":"Speech recognition (SR) is the inter-disciplinary sub-field of computational linguistics which incorporates knowledge and research in the linguistics, computer science, and electrical engineering fields to develop methodologies and technologies that enables the recognition and translation of spoken language into text by computers and computerized devices such as those categorized as smart technologies and robotics. It is also known as \"automatic speech recognition\" (ASR), \"computer speech recognition\", or just \"speech to text\" (STT).","title":"Speech recognition","abstract":"Speech recognition (SR) is the inter-disciplinary sub-field of computational linguistics which incorporates knowledge and research in the linguistics, computer science, and electrical engineering fields to develop methodologies and technologies that enables the recognition and translation of spoken language into text by computers and computerized devices such as those categorized as smart technologies and robotics. It is also known as \"automatic speech recognition\" (ASR), \"computer speech recognition\", or just \"speech to text\" (STT). Some SR systems use \"training\" (also called \"enrollment\") where an individual speaker reads text or isolated vocabulary into the system. The system analyzes the person's specific voice and uses it to fine-tune the recognition of that person's speech, resulting in increased accuracy. Systems that do not use training are called \"speaker independent\" systems. Systems that use training are called \"speaker dependent\". Speech recognition applications include voice user interfaces such as voice dialing (e.g. \"Call home\"), call routing (e.g. \"I would like to make a collect call\"), domotic appliance control, search (e.g. find a podcast where particular words were spoken), simple data entry (e.g., entering a credit card number), preparation of structured documents (e.g. a radiology report), speech-to-text processing (e.g., word processors or emails), and aircraft (usually termed Direct Voice Input). The term voice recognition or speaker identification refers to identifying the speaker, rather than what they are saying. Recognizing the speaker can simplify the task of translating speech in systems that have been trained on a specific person's voice or it can be used to authenticate or verify the identity of a speaker as part of a security process. From the technology perspective, speech recognition has a long history with several waves of major innovations. Most recently, the field has benefited from advances in deep learning and big data. The advances are evidenced not only by the surge of academic papers published in the field, but more importantly by the world-wide industry adoption of a variety of deep learning methods in designing and deploying speech recognition systems. These speech industry players include Google, Microsoft, Hewlett Packard Enterprise, IBM, Baidu (China), Apple, Amazon, Nuance, IflyTek (China), many of which have publicized the core technology in their speech recognition systems as being based on deep learning.","source":"http://en.wikipedia.org/wiki/Speech_recognition"},"https://en.wikipedia.org/wiki/Brain%E2%80%93computer_interface":{"ref":[]},"https://en.wikipedia.org/wiki/Computer_vision":{"ref":[],"title":"Computer vision","source":"http://en.wikipedia.org/wiki/Computer_vision","abstract":"Computer vision is an interdisciplinary field that deals with how computers can be made to gain high-level understanding from digital images or videos. From the perspective of engineering, it seeks to automate tasks that the human visual system can do. Computer vision tasks include methods for acquiring, processing, analyzing and understanding digital images, and in general, deal with the extraction of high-dimensional data from the real world in order to produce numerical or symbolic information, e.g., in the forms of decisions. Understanding in this context means the transformation of visual images (the input of the retina) into descriptions of the world that can interface with other thought processes and elicit appropriate action. This image understanding can be seen as the disentangling of symbolic information from image data using models constructed with the aid of geometry, physics, statistics, and learning theory. As a scientific discipline, computer vision is concerned with the theory behind artificial systems that extract information from images. The image data can take many forms, such as video sequences, views from multiple cameras, or multi-dimensional data from a medical scanner. As a technological discipline, computer vision seeks to apply its theories and models for the construction of computer vision systems. Sub-domains of computer vision include scene reconstruction, event detection, video tracking, object recognition, object pose estimation, learning, indexing, motion estimation, and image restoration.","summary":"Computer vision is an interdisciplinary field that deals with how computers can be made to gain high-level understanding from digital images or videos. From the perspective of engineering, it seeks to automate tasks that the human visual system can do. Sub-domains of computer vision include scene reconstruction, event detection, video tracking, object recognition, object pose estimation, learning, indexing, motion estimation, and image restoration."},"https://en.wikipedia.org/wiki/Predictive_analytics":{"ref":[],"abstract":"Predictive analytics encompasses a variety of statistical techniques from predictive modeling, machine learning, and data mining that analyze current and historical facts to make predictions about future or otherwise unknown events. In business, predictive models exploit patterns found in historical and transactional data to identify risks and opportunities. Models capture relationships among many factors to allow assessment of risk or potential associated with a particular set of conditions, guiding decision making for candidate transactions. The defining functional effect of these technical approaches is that predictive analytics provides a predictive score (probability) for each individual (customer, employee, healthcare patient, product SKU, vehicle, component, machine, or other organizational unit) in order to determine, inform, or influence organizational processes that pertain across large numbers of individuals, such as in marketing, credit risk assessment, fraud detection, manufacturing, healthcare, and government operations including law enforcement. Predictive analytics is used in actuarial science, marketing, financial services, insurance, telecommunications, retail, travel, healthcare, child protection, pharmaceuticals, capacity planning and other fields. One of the most well known applications is credit scoring, which is used throughout financial services. Scoring models process a customer's credit history, loan application, customer data, etc., in order to rank-order individuals by their likelihood of making future credit payments on time.","summary":"Predictive analytics encompasses a variety of statistical techniques from predictive modeling, machine learning, and data mining that analyze current and historical facts to make predictions about future or otherwise unknown events. In business, predictive models exploit patterns found in historical and transactional data to identify risks and opportunities. Models capture relationships among many factors to allow assessment of risk or potential associated with a particular set of conditions, guiding decision making for candidate transactions.","title":"Predictive analytics","source":"http://en.wikipedia.org/wiki/Predictive_analytics"},"https://en.wikipedia.org/wiki/Prescriptive_analytics":{"ref":[],"title":"Prescriptive analytics","abstract":"Prescriptive analytics is the third and final phase of analytics (BA) which also includes descriptive and predictive analytics. Referred to as the \"final frontier of analytic capabilities,\" prescriptive analytics entails the application of mathematical and computational sciences suggests decision options to take advantage of the results of descriptive and predictive analytics. The first stage of business analytics is descriptive analytics, which still accounts for the majority of all business analytics today. Descriptive analytics looks at past performance and understands that performance by mining historical data to look for the reasons behind past success or failure. Most management reporting - such as sales, marketing, operations, and finance - uses this type of post-mortem analysis. The next phase is predictive analytics. Predictive analytics answers the question what is likely to happen. This is when historical data is combined with rules, algorithms, and occasionally external data to determine the probable future outcome of an event or the likelihood of a situation occurring. The final phase is prescriptive analytics, which goes beyond predicting future outcomes by also suggesting actions to benefit from the predictions and showing the implications of each decision option. This is not correct. Prescriptive analytics not only anticipates what will happen and when it will happen, but also why it will happen. Further, prescriptive analytics suggests decision options on how to take advantage of a future opportunity or mitigate a future risk and shows the implication of each decision option. Prescriptive analytics can continually take in new data to re-predict and re-prescribe, thus automatically improving prediction accuracy and prescribing better decision options. Prescriptive analytics ingests hybrid data, a combination of structured (numbers, categories) and unstructured data (videos, images, sounds, texts), and business rules to predict what lies ahead and to prescribe how to take advantage of this predicted future without compromising other priorities. All three phases of analytics can be performed through professional services or technology or a combination. In order to scale, prescriptive analytics technologies need to be adaptive to take into account the growing volume, velocity, and variety of data that most mission critical processes and their environments may produce. One criticism of prescriptive analytics is that its distinction from predictive analytics is ill-defined and therefore ill-conceived.","source":"http://en.wikipedia.org/wiki/Prescriptive_analytics","summary":"Prescriptive analytics is the third and final phase of analytics (BA) which also includes descriptive and predictive analytics. Referred to as the \"final frontier of analytic capabilities,\" prescriptive analytics entails the application of mathematical and computational sciences suggests decision options to take advantage of the results of descriptive and predictive analytics. The first stage of business analytics is descriptive analytics, which still accounts for the majority of all business analytics today. Descriptive analytics looks at past performance and understands that performance by mining historical data to look for the reasons behind past success or failure. Most management reporting - such as sales, marketing, operations, and finance - uses this type of post-mortem analysis."},"https://en.wikipedia.org/wiki/Machine_learning":{"ref":[],"summary":"Machine learning is the subfield of computer science that \"gives computers the ability to learn without being explicitly programmed\" (Arthur Samuel, 1959). Evolved from the study of pattern recognition and computational learning theory in artificial intelligence, machine learning explores the study and construction of algorithms that can learn from and make predictions on data – such algorithms overcome following strictly static program instructions by making data-driven predictions or decisions, through building a model from sample inputs. Machine learning is employed in a range of computing tasks where designing and programming explicit algorithms is unfeasible; example applications include spam filtering, optical character recognition (OCR), search engines and computer vision.","source":"http://en.wikipedia.org/wiki/Machine_learning","abstract":"Machine learning is the subfield of computer science that \"gives computers the ability to learn without being explicitly programmed\" (Arthur Samuel, 1959). Evolved from the study of pattern recognition and computational learning theory in artificial intelligence, machine learning explores the study and construction of algorithms that can learn from and make predictions on data – such algorithms overcome following strictly static program instructions by making data-driven predictions or decisions, through building a model from sample inputs. Machine learning is employed in a range of computing tasks where designing and programming explicit algorithms is unfeasible; example applications include spam filtering, optical character recognition (OCR), search engines and computer vision. Machine learning is closely related to (and often overlaps with) computational statistics, which also focuses in prediction-making through the use of computers. It has strong ties to mathematical optimization, which delivers methods, theory and application domains to the field. Machine learning is sometimes conflated with data mining, where the latter subfield focuses more on exploratory data analysis and is known as unsupervised learning. Within the field of data analytics, machine learning is a method used to devise complex models and algorithms that lend themselves to prediction; in commercial use, this is known as predictive analytics. These analytical models allow researchers, data scientists, engineers, and analysts to \"produce reliable, repeatable decisions and results\" and uncover \"hidden insights\" through learning from historical relationships and trends in the data.","title":"Machine learning"},"https://en.wikipedia.org/wiki/Distributed_computing":{"ref":[],"summary":"Distributed Computing is a field of computer science that studies distributed systems. A distributed system is a model in which components located on networked computers communicate and coordinate their actions by passing messages. The components interact with each other in order to achieve a common goal. Three significant characteristics of distributed systems are: concurrency of components, lack of a global clock, and independent failure of components. Examples of distributed systems vary from SOA-based systems to massively multiplayer online games to  peer-to-peer applications.","abstract":"Distributed Computing is a field of computer science that studies distributed systems. A distributed system is a model in which components located on networked computers communicate and coordinate their actions by passing messages. The components interact with each other in order to achieve a common goal. Three significant characteristics of distributed systems are: concurrency of components, lack of a global clock, and independent failure of components. Examples of distributed systems vary from SOA-based systems to massively multiplayer online games to  peer-to-peer applications. A computer program that runs in a distributed system is called a distributed program, and distributed programming is the process of writing such programs. There are many alternatives for the message passing mechanism, including pure HTTP, RPC-like connectors and message queues. A goal and challenge pursued by some computer scientists and practitioners in distributed systems is location transparency; however, this goal has fallen out of favour in industry, as distributed systems are different from conventional non-distributed systems, and the differences, such as network partitions, partial system failures, and partial upgrades, cannot simply be \"papered over\" by attempts at \"transparency\" (see CAP theorem). Distributed computing also refers to the use of distributed systems to solve computational problems. In distributed computing, a problem is divided into many tasks, each of which is solved by one or more computers, which communicate with each other by message passing.","title":"Distributed computing","source":"http://en.wikipedia.org/wiki/Distributed_computing"},"https://en.wikipedia.org/wiki/Time_series_database":{"ref":[],"abstract":"A time series database (TSDB) is a software system that is optimized for handling time series data, arrays of numbers indexed by time (a datetime or a datetime range). In some fields these time series are called profiles, curves, or traces. A time series of stock prices might be called a price curve. A time series of energy consumption might be called a load profile. A log of temperature values over time might be called a temperature trace. Despite the disparate names, many of the same mathematical operations, queries, or database transactions are useful for analysing all of them. The implementation of a database that can correctly, reliably, and efficiently implement these operations must be specialized for time-series data. TSDBs are databases that are optimized for time series data. Software with complex logic or business rules and high transaction volume for time series data may not be practical with traditional relational database management systems. Flat file databases are not a viable option either, if the data and transaction volume reaches a maximum threshold determined by the capacity of individual servers (processing power and storage capacity). Queries for historical data, replete with time ranges and roll ups and arbitrary time zone conversions are difficult in a relational database. Compositions of those rules are even more difficult. This is a problem compounded by the free nature of relational systems themselves. Many relational systems are often not modelled correctly with respect to time series data. TSDBs on the other hand impose a model and this allows them to provide more features for doing so. Ideally, these repositories are often natively implemented using specialized database algorithms. However, it is possible to store time series as binary large objects (BLOBs) in a relational database or by using a VLDB approach coupled with a pure star schema. Efficiency is often improved if time is treated as a discrete quantity rather than as a continuous mathematical dimension. Database joins across multiple time series data sets is only practical when the time tag associated with each data entry spans the same set of discrete times for all data sets across which the join is performed.","source":"http://en.wikipedia.org/wiki/Time_series_database","summary":"A time series database (TSDB) is a software system that is optimized for handling time series data, arrays of numbers indexed by time (a datetime or a datetime range). In some fields these time series are called profiles, curves, or traces. A time series of stock prices might be called a price curve. A time series of energy consumption might be called a load profile. A log of temperature values over time might be called a temperature trace.","title":"Time series database"},"https://en.wikipedia.org/wiki/Robotic_arm":{"ref":[],"abstract":"A robotic arm is a type of mechanical arm, usually programmable, with similar functions to a human arm; the arm may be the sum total of the mechanism or may be part of a more complex robot. The links of such a manipulator are connected by joints allowing either rotational motion (such as in an articulated robot) or translational (linear) displacement. The links of the manipulator can be considered to form a kinematic chain. The terminus of the kinematic chain of the manipulator is called the end effector and it is analogous to the human hand.","summary":"A robotic arm is a type of mechanical arm, usually programmable, with similar functions to a human arm; the arm may be the sum total of the mechanism or may be part of a more complex robot. The links of such a manipulator are connected by joints allowing either rotational motion (such as in an articulated robot) or translational (linear) displacement. The links of the manipulator can be considered to form a kinematic chain. The terminus of the kinematic chain of the manipulator is called the end effector and it is analogous to the human hand.","title":"Robotic arm","source":"http://en.wikipedia.org/wiki/Robotic_arm"},"https://en.wikipedia.org/wiki/Z-Wave":{"ref":[],"title":"Z-Wave","summary":"Z-Wave is a wireless communications protocol used primarily for home automation. It is oriented to the residential control and automation market and is intended to provide a simple and reliable method to wirelessly control lighting, HVAC, security systems, home cinema, automated window treatments, swimming pool and spa controls, and garage and home access controls. Like other protocols and systems aimed at the home and office automation market, a Z-Wave automation system can be controlled via the Internet, with a Z-Wave gateway or central control device serving as both the Z-Wave hub controller and portal to the outside. Z-Wave was originally developed by Danish startup Zen-Sys and later acquired by Sigma Designs in 2008. There are over 1,500 of interoperable Z-Wave products marketed under","abstract":"Z-Wave is a wireless communications protocol used primarily for home automation. It is oriented to the residential control and automation market and is intended to provide a simple and reliable method to wirelessly control lighting, HVAC, security systems, home cinema, automated window treatments, swimming pool and spa controls, and garage and home access controls. Like other protocols and systems aimed at the home and office automation market, a Z-Wave automation system can be controlled via the Internet, with a Z-Wave gateway or central control device serving as both the Z-Wave hub controller and portal to the outside. Z-Wave was originally developed by Danish startup Zen-Sys and later acquired by Sigma Designs in 2008. There are over 1,500 of interoperable Z-Wave products marketed under different brands, and over 35 million have been sold since 2005.","source":"http://en.wikipedia.org/wiki/Z-Wave"},"https://en.wikipedia.org/wiki/ZigBee":{"ref":[],"source":"http://en.wikipedia.org/wiki/ZigBee","title":"ZigBee","abstract":"ZigBee is an IEEE 802.15.4-based specification for a suite of high-level communication protocols used to create personal area networks with small, low-power digital radios. The technology defined by the ZigBee specification is intended to be simpler and less expensive than other wireless personal area networks (WPANs), such as Bluetooth or Wi-Fi. Applications include wireless light switches, electrical meters with in-home-displays, traffic management systems, and other consumer and industrial equipment that requires short-range low-rate wireless data transfer. Its low power consumption limits transmission distances to 10–100 meters line-of-sight, depending on power output and environmental characteristics. ZigBee devices can transmit data over long distances by passing data through a mesh network of intermediate devices to reach more distant ones. ZigBee is typically used in low data rate applications that require long battery life and secure networking (ZigBee networks are secured by 128 bit symmetric encryption keys.) ZigBee has a defined rate of 250 kbit/s, best suited for intermittent data transmissions from a sensor or input device. ZigBee was conceived in 1998, standardized in 2003, and revised in 2006. The name refers to the waggle dance of honey bees after their return to the beehive.","summary":"ZigBee is an IEEE 802.15.4-based specification for a suite of high-level communication protocols used to create personal area networks with small, low-power digital radios. The technology defined by the ZigBee specification is intended to be simpler and less expensive than other wireless personal area networks (WPANs), such as Bluetooth or Wi-Fi. Applications include wireless light switches, electrical meters with in-home-displays, traffic management systems, and other consumer and industrial equipment that requires short-range low-rate wireless data transfer."},"https://en.wikipedia.org/wiki/NarrowBand_IOT":{"ref":[],"abstract":"NarrowBand IoT (NB-IoT) is a Low Power Wide Area Network (LPWAN) radio technology standard that has been developed to enable a wide range of devices and services to be connected using cellular telecommunications bands. NB-IoT is a narrowband radio technology designed for the Internet of Things (IoT), and is one of a range of Mobile IoT (MIoT) technologies standardized by the 3rd Generation Partnership Project (3GPP). Other 3GPP IoT technologies include eMTC and EC-GSM-IoT. The NB-IoT specification was frozen at Release 13 of the 3GPP specification (LTE-Advanced Pro), in June 2016. NB-IoT focuses specifically on indoor coverage, low cost, long battery life, and enabling a large number of connected devices. The NB-IoT technology can either be deployed “in-band” in spectrum allocated to Long Term Evolution (LTE)—utilizing resource blocks within a normal LTE carrier, or in the unused resource blocks within a LTE carrier’s guard-band—or “standalone” for deployments in dedicated spectrum. It is also suitable for the re-farming of GSM spectrum. \n* Preliminary specification (Source: 3GPP)","title":"NarrowBand IOT","source":"http://en.wikipedia.org/wiki/NarrowBand_IOT","summary":"NarrowBand IoT (NB-IoT) is a Low Power Wide Area Network (LPWAN) radio technology standard that has been developed to enable a wide range of devices and services to be connected using cellular telecommunications bands. NB-IoT is a narrowband radio technology designed for the Internet of Things (IoT), and is one of a range of Mobile IoT (MIoT) technologies standardized by the 3rd Generation Partnership Project (3GPP). Other 3GPP IoT technologies include eMTC and EC-GSM-IoT. The NB-IoT specification was frozen at Release 13 of the 3GPP specification (LTE-Advanced Pro), in June 2016."},"https://en.wikipedia.org/wiki/Artificial_intelligence":{"ref":[],"title":"Artificial intelligence","summary":"Artificial intelligence (AI) is intelligence exhibited by machines. In computer science, an ideal \"intelligent\" machine is a flexible rational agent that perceives its environment and takes actions that maximize its chance of success at some goal. Colloquially, the term \"artificial intelligence\" is applied when a machine mimics \"cognitive\" functions that humans associate with other human minds, such as \"learning\" and \"problem solving\". As machines become increasingly capable, facilities once thought to require intelligence are removed from the definition. For example, optical character recognition is no longer perceived as an exemplar of \"artificial intelligence\" having become a routine technology. Capabilities currently classified as AI include successfully understanding human speech, com","source":"http://en.wikipedia.org/wiki/Artificial_intelligence","abstract":"Artificial intelligence (AI) is intelligence exhibited by machines. In computer science, an ideal \"intelligent\" machine is a flexible rational agent that perceives its environment and takes actions that maximize its chance of success at some goal. Colloquially, the term \"artificial intelligence\" is applied when a machine mimics \"cognitive\" functions that humans associate with other human minds, such as \"learning\" and \"problem solving\". As machines become increasingly capable, facilities once thought to require intelligence are removed from the definition. For example, optical character recognition is no longer perceived as an exemplar of \"artificial intelligence\" having become a routine technology. Capabilities currently classified as AI include successfully understanding human speech, competing at a high level in strategic game systems (such as Chess and Go), self-driving cars, and interpreting complex data. AI research is divided into subfields that focus on specific  or on specific  or on the use of a particular  or towards satisfying particular . The central problems (or goals) of AI research include reasoning, knowledge, planning, learning, natural language processing (communication), perception and the ability to move and manipulate objects. General intelligence is among the field's long-term goals. Approaches include , , soft computing (e.g. machine learning), and . Many tools are used in AI, including versions of , , . The AI field draws upon computer science, mathematics, psychology, linguistics, philosophy, neuroscience and artificial psychology. The field was founded on the claim that human intelligence \"can be so precisely described that a machine can be made to simulate it.\" This raises philosophical arguments about the nature of the mind and the ethics of creating artificial beings endowed with human-like intelligence, issues which have been explored by myth, fiction and philosophy since antiquity. Attempts to create artificial intelligence have experienced many setbacks, including the ALPAC report of 1966, the abandonment of perceptrons in 1970, the Lighthill Report of 1973 and the collapse of the Lisp machine market in 1987. In the twenty-first century AI techniques became an essential part of the technology industry, helping to solve many challenging problems in computer science."},"https://en.wikipedia.org/wiki/GitHub":{"ref":[],"abstract":"GitHub is a web-based Git repository hosting service. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project. GitHub offers both plans for private repositories, and free accounts which are commonly used to host open-source software projects. As of April 2016, GitHub reports having more than 14 million users and more than 35 million repositories, making it the largest host of source code in the world. The trademark mascot of GitHub is Octocat, an anthropomorphized cat with cephalopod limbs, portrayed in a manga style.","source":"http://en.wikipedia.org/wiki/GitHub","summary":"GitHub is a web-based Git repository hosting service. It offers all of the distributed version control and source code management (SCM) functionality of Git as well as adding its own features. It provides access control and several collaboration features such as bug tracking, feature requests, task management, and wikis for every project. The trademark mascot of GitHub is Octocat, an anthropomorphized cat with cephalopod limbs, portrayed in a manga style.","title":"GitHub"},"https://en.wikipedia.org/wiki/OpenCorporates":{"ref":[],"abstract":"OpenCorporates is a website which shares data on corporate entities as open data under the share-alike attribution Open Database Licence. It was created by Chris Taggart and Rob McKinnon, under the auspices of their company, Chrinon Ltd, and launched on 20 December 2010. It has the aims of creating a URL with such data for every corporate entity in the world, importing government data relating to companies and matching it to specific companies. The site also shows groups of companies which are legally part of the same conglomerate. Basic company information is available as open data in XML or JSON format. The OpenCorporates Advisory Board exists to advise OpenCorporates on policy, practice and principles, and to ensure that OpenCorporates remains true to its central mission of the opening of company data for the public good. It's formed by three members actually: David Eaves, Kaitlin Lee and Andrew Stott. The same team also operate OpenCharities, compiling data on registered charities.","title":"OpenCorporates","summary":"OpenCorporates is a website which shares data on corporate entities as open data under the share-alike attribution Open Database Licence. It was created by Chris Taggart and Rob McKinnon, under the auspices of their company, Chrinon Ltd, and launched on 20 December 2010. It has the aims of creating a URL with such data for every corporate entity in the world, importing government data relating to companies and matching it to specific companies. The same team also operate OpenCharities, compiling data on registered charities.","source":"http://en.wikipedia.org/wiki/OpenCorporates"},"https://en.wikipedia.org/wiki/Periscope_(app)":{"ref":[],"title":"Periscope (app)","summary":"Periscope is a live video streaming app for iOS and Android developed by Kayvon Beykpour and Joe Bernstein and acquired by Twitter before launch in 2015.","source":"http://en.wikipedia.org/wiki/Periscope_(app)","abstract":"Periscope is a live video streaming app for iOS and Android developed by Kayvon Beykpour and Joe Bernstein and acquired by Twitter before launch in 2015."},"https://en.wikipedia.org/wiki/Snapchat":{"ref":[],"source":"http://en.wikipedia.org/wiki/Snapchat","summary":"Snapchat is an image messaging and multimedia mobile application created by Evan Spiegel, Bobby Murphy, and Reggie Brown when they were students at Stanford University. The app's marketed product name was originally used to form the company Snapchat, Inc., which was later renamed Snap Inc. The corporate headquarters are located in Venice, California. The prototype for Snapchat was started by Brown and Spiegel as a project for one of Spiegel's classes at Stanford, where Spiegel was a product design major. Beginning under the name \"Picaboo\", the idea was to create a selfie app which allowed users to share images that were explicitly short-lived and self-deleting. The temporary nature of the pictures would therefore encourage frivolity and emphasize a more natural interaction. When, in April ","abstract":"Snapchat is an image messaging and multimedia mobile application created by Evan Spiegel, Bobby Murphy, and Reggie Brown when they were students at Stanford University. The app's marketed product name was originally used to form the company Snapchat, Inc., which was later renamed Snap Inc. The corporate headquarters are located in Venice, California. The prototype for Snapchat was started by Brown and Spiegel as a project for one of Spiegel's classes at Stanford, where Spiegel was a product design major. Beginning under the name \"Picaboo\", the idea was to create a selfie app which allowed users to share images that were explicitly short-lived and self-deleting. The temporary nature of the pictures would therefore encourage frivolity and emphasize a more natural interaction. When, in April 2011, Spiegel floated the product idea in front of his class as a final project, the classmates focused on the impermanent aspect of the potential product, and balked at the thought of temporary photos. Murphy was eventually brought into the project to write the source code for the application, and Picaboo first launched as an iOS-only app in July 2011 from Evan Spiegel's living room (who was still staying at home with his father when not away at school). The application was relaunched two months later under the name Snapchat. Snapchat evolved into a mix of private messaging and public content, including brand networks, publications, and live events such as sports and music. Nevertheless, according to survey studies conducted in March 2016, the personal oriented messaging was still being accessed by users more than the publicly offered content that was being presented. 71% of users surveyed said that they preferred the app for its chat, messaging, and imaging services, versus 5% who almost exclusively chose the various events, published features, and media content on a daily basis. 24% responded that they accessed all features equally. However, about three quarters of those surveyed were also familiar with the events, media brands, and celebrity content, having a favorable opinion of those areas.","title":"Snapchat"},"https://en.wikipedia.org/wiki/Coursera":{"ref":[],"summary":"Coursera /kərˈsɛrə/ is a venture-backed, for-profit, educational technology company that offers massive open online courses (MOOCs). Coursera works with universities and other organizations to make some of their courses available online, offering courses in subjects, such as: physics, engineering, humanities, medicine, biology, social sciences, mathematics, business, computer science, digital marketing, data science, and other subjects.","source":"http://en.wikipedia.org/wiki/Coursera","title":"Coursera","abstract":"Coursera /kərˈsɛrə/ is a venture-backed, for-profit, educational technology company that offers massive open online courses (MOOCs). Coursera works with universities and other organizations to make some of their courses available online, offering courses in subjects, such as: physics, engineering, humanities, medicine, biology, social sciences, mathematics, business, computer science, digital marketing, data science, and other subjects."},"https://en.wikipedia.org/wiki/Flipboard":{"ref":[],"title":"Flipboard","abstract":"Flipboard launched in July 2010 as the world's first social magazine, where content from social networks, publishers, online sources and photo sharing sites could all be accessed in one place. Since its launch the mobile app has won dozens of awards for design and mobile innovation, including iPad app of the year. The service collects content from social media, news feeds, and other websites, presents it in magazine format, and allows users to \"flip\" through the articles, images and videos being shared. Readers can also save stories into Flipboard Magazines. As of March 2016 there have been 28 million magazines created by users on Flipboard. Available for mobile devices via all major app stores or at www.flipboard.com, Flipboard is free and localized in more than 20 languages. The company is headquartered in Palo Alto, California with offices in New York, Vancouver and Bejiing.","summary":"Flipboard launched in July 2010 as the world's first social magazine, where content from social networks, publishers, online sources and photo sharing sites could all be accessed in one place. Since its launch the mobile app has won dozens of awards for design and mobile innovation, including iPad app of the year. The service collects content from social media, news feeds, and other websites, presents it in magazine format, and allows users to \"flip\" through the articles, images and videos being shared. Readers can also save stories into Flipboard Magazines. As of March 2016 there have been 28 million magazines created by users on Flipboard.","source":"http://en.wikipedia.org/wiki/Flipboard"},"https://en.wikipedia.org/wiki/Kinect":{"ref":[],"abstract":"Kinect (codenamed Project Natal during development) is a line of motion sensing input devices by Microsoft for Xbox 360 and Xbox One video game consoles and Windows PCs. Based around a webcam-style add-on peripheral, it enables users to control and interact with their console/computer without the need for a game controller, through a natural user interface using gestures and spoken commands. The first-generation Kinect was first introduced in November 2010 in an attempt to broaden Xbox 360's audience beyond its typical gamer base. A version for Windows was released on February 1, 2012. Kinect competes with several motion controllers on other home consoles, such as Wii Remote Plus for Wii and Wii U, PlayStation Move/PlayStation Eye for PlayStation 3, and PlayStation Camera for PlayStation 4. Microsoft released the Kinect software development kit for Windows 7 on June 16, 2011. This SDK was meant to allow developers to write Kinecting apps in C++/CLI, C#, or Visual Basic .NET.","title":"Kinect","source":"http://en.wikipedia.org/wiki/Kinect","summary":"Kinect (codenamed Project Natal during development) is a line of motion sensing input devices by Microsoft for Xbox 360 and Xbox One video game consoles and Windows PCs. Based around a webcam-style add-on peripheral, it enables users to control and interact with their console/computer without the need for a game controller, through a natural user interface using gestures and spoken commands. The first-generation Kinect was first introduced in November 2010 in an attempt to broaden Xbox 360's audience beyond its typical gamer base. A version for Windows was released on February 1, 2012. Kinect competes with several motion controllers on other home consoles, such as Wii Remote Plus for Wii and Wii U, PlayStation Move/PlayStation Eye for PlayStation 3, and PlayStation Camera for PlayStation 4"},"https://en.wikipedia.org/wiki/Microsoft_HoloLens":{"ref":[],"source":"http://en.wikipedia.org/wiki/Microsoft_HoloLens","title":"Microsoft HoloLens","summary":"Microsoft HoloLens, known under development as Project Baraboo, is a pair of mixed reality head-mounted smartglasses developed and manufactured by Microsoft. HoloLens gained popularity for being one of the first computers running the Windows Holographic platform under the Windows 10 operating system. The HoloLens can trace its lineage to Kinect, an add-on for Microsoft's Xbox gaming console that was introduced in 2010.","abstract":"Microsoft HoloLens, known under development as Project Baraboo, is a pair of mixed reality head-mounted smartglasses developed and manufactured by Microsoft. HoloLens gained popularity for being one of the first computers running the Windows Holographic platform under the Windows 10 operating system. The HoloLens can trace its lineage to Kinect, an add-on for Microsoft's Xbox gaming console that was introduced in 2010. The pre-production version of HoloLens, the Development Edition, shipped on the 30th of March 2016, and is targeted to developers in the United States and Canada for a list price of $3,000. Samsung and Asus have extended an offer to Microsoft to help produce their own mixed-reality products, in collaboration with Microsoft, based around the concept and hardware on HoloLens. On October 12, 2016, Microsoft announced gobal expansion of Hololens and publicised that Hololens would be avaialble for preorder in Australia, Ireland, France, Germany, New Zealand and the United Kingdom."},"https://en.wikipedia.org/wiki/IFTTT":{"ref":[],"title":"IFTTT","summary":"IFTTT is a free web-based service that allows users to create chains of simple conditional statements, called \"recipes\", which are triggered based on changes to other web services such as Gmail, Facebook, Instagram, and Pinterest. IFTTT is an abbreviation of \"If This Then That\". An example \"recipe\" might consist of sending an e-mail message if the IFTTT user tweets using a certain hashtag. Or, if the user is tagged by someone on Facebook, then that photo will be added to the user's cloud-based photo archive.","abstract":"IFTTT is a free web-based service that allows users to create chains of simple conditional statements, called \"recipes\", which are triggered based on changes to other web services such as Gmail, Facebook, Instagram, and Pinterest. IFTTT is an abbreviation of \"If This Then That\". An example \"recipe\" might consist of sending an e-mail message if the IFTTT user tweets using a certain hashtag. Or, if the user is tagged by someone on Facebook, then that photo will be added to the user's cloud-based photo archive. IFTTT was created by Linden Tibbets, Jesse Tane, Scott Tong and Alexander Tibbets in San Francisco, California. IFTTT was launched in September 7, 2011. Today, IFTTT recipes are widely used and shared by its users. In addition to the Web-based application, IFTTT for iPhone was launched on July 10, 2013 and contained three channels: iOS Photos, Reminders and Contacts. An iPad version with iOS notification support was later introduced on April 3, 2014. Later that month, on April 24, 2014, IFTTT released an Android version of the app. On February 19, 2015, IFTTT renamed their original application to IF and released a new suite of apps called Do. The Do apps allow users to create customizable shortcut applications and actions. Linden Tibbets also announced that IFTTT users are now \"cooking\" about 20 million \"recipes\" each day.","source":"http://en.wikipedia.org/wiki/IFTTT"},"https://en.wikipedia.org/wiki/Feedly":{"ref":[],"abstract":"Feedly (stylized as feedly) is a news aggregator application for various web browsers and mobile devices running iOS and Android, also available as a cloud-based service. It compiles news feeds from a variety of online sources for the user to customize and share with others. Feedly was first released by DevHD in 2008.","source":"http://en.wikipedia.org/wiki/Feedly","title":"Feedly","summary":"Feedly (stylized as feedly) is a news aggregator application for various web browsers and mobile devices running iOS and Android, also available as a cloud-based service. It compiles news feeds from a variety of online sources for the user to customize and share with others. Feedly was first released by DevHD in 2008."},"https://en.wikipedia.org/wiki/Digg":{"ref":[],"source":"http://en.wikipedia.org/wiki/Digg","title":"Digg","summary":"Digg is a news aggregator with a curated front page, aiming to select stories specifically for the Internet audience such as science, trending political issues, and viral Internet issues. It was launched in its current form on July 31, 2012, with support for sharing content to other social platforms such as Twitter and Facebook. In September 2016, Digg announced that it would begin a data partnership with Gannett. The \"seven figure\" investment would give Gannett access to real-time trend analysis of Digg's 7.5 million pieces of content.","abstract":"Digg is a news aggregator with a curated front page, aiming to select stories specifically for the Internet audience such as science, trending political issues, and viral Internet issues. It was launched in its current form on July 31, 2012, with support for sharing content to other social platforms such as Twitter and Facebook. It formerly had been a very popular social news website, allowing people to vote web content up or down, called digging and burying, respectively. Quantcast had estimated Digg's monthly U.S. unique visits at 3.8 million. Digg's popularity prompted the creation of similar social networking sites with story submission and voting systems such as Reddit. In July 2008, the former company took part in advanced acquisition talks with Google for a reported $200 million price tag, but the deal ultimately fell through. After a controversial 2010 redesign and the departure of co-founders Jay Adelson and Kevin Rose, in July 2012 Digg was sold in three parts: the Digg brand, website and technology were sold to the current owner, Betaworks, for an estimated $500,000; 15 staff were transferred to the Washington Post's \"SocialCode\" for a reported $12 million; and a suite of patents was sold to LinkedIn for about $4 million. In September 2016, Digg announced that it would begin a data partnership with Gannett. The \"seven figure\" investment would give Gannett access to real-time trend analysis of Digg's 7.5 million pieces of content."},"https://en.wikipedia.org/wiki/NewsBlur":{"ref":[],"source":"http://en.wikipedia.org/wiki/NewsBlur","title":"NewsBlur","summary":"NewsBlur is an American software company based in New York City and San Francisco. It runs an online RSS news reader service accessible both online and via a free open-source mobile app for offline reading. Furthermore, the software powering Newsblur is available and is published in an open-source application, licensed under the MIT License. Limited access to the service is free for up to 64 sites; unlimited access is available for an annual subscription fee.","abstract":"NewsBlur is an American software company based in New York City and San Francisco. It runs an online RSS news reader service accessible both online and via a free open-source mobile app for offline reading. Furthermore, the software powering Newsblur is available and is published in an open-source application, licensed under the MIT License. Limited access to the service is free for up to 64 sites; unlimited access is available for an annual subscription fee. The company was founded in 2009 by Samuel Clay. In March 2013, following an announcement by Google that they would be shutting down their popular Google Reader news reader service, NewsBlur's subscriber base immediately rose from about 1,500 users to over 60,000."},"https://en.wikipedia.org/wiki/Netvibes":{"ref":[],"title":"Netvibes","source":"http://en.wikipedia.org/wiki/Netvibes","abstract":"Netvibes is a company. Common uses: \n* Brand Monitoring – to track clients, customers and competitors across media sources all in one place, analyze live results with 3rd party reporting tools, and provide media monitoring dashboards for brand clients. \n* E-Reputation Management – to visualize real-time conversations and social activity feeds, and track new trending topics. \n* Product Marketing – to create interactive product microsites, with drag-and-drop publishing interface. \n* Community Portals – to engage online communities  \n* Personalized Workspaces – to gather all essential company updates to support specific divisions (e.g. sales, marketing, HR) and localizations. The software is a multi-lingual Ajax-based start page or web portal. It is organized into tabs, with each tab containing user-defined modules. Built-in Netvibes modules include an RSS/Atom feed reader, local weather forecasts, a calendar supporting iCal, bookmarks, notes, to-do lists, multiple searches, support for POP3, IMAP4 email as well as several webmail providers including Gmail, Yahoo! Mail, Hotmail, and AOL Mail, Box.net web storage, Delicious, Meebo, Flickr photos, podcast support with a built-in audio player, and several others. A page can be personalized further through the use of existing themes or by creating personal theme. Customized tabs, feeds and modules can be shared with others individually or via the Netvibes Ecosystem. For privacy reasons, only modules with publicly available content can be shared.","summary":"Netvibes is a company. Common uses: \n* Brand Monitoring – to track clients, customers and competitors across media sources all in one place, analyze live results with 3rd party reporting tools, and provide media monitoring dashboards for brand clients. \n* E-Reputation Management – to visualize real-time conversations and social activity feeds, and track new trending topics. \n* Product Marketing – to create interactive product microsites, with drag-and-drop publishing interface. \n* Community Portals – to engage online communities  \n* Personalized Workspaces – to gather all essential company updates to support specific divisions (e.g. sales, marketing, HR) and localizations."},"https://en.wikipedia.org/wiki/ShareCAD":{"ref":[],"abstract":"ShareCAD or ShareCAD.org is a free online service aimed at viewing different DWG and CAD formats as well as 3D models in a web browser.  The service doesn’t require any installation or registration and enables users to view vector, raster and 3D formats online. ShareCAD also offers its users a free iframe plugin for viewing DWG at a site. The service runs in web browsers powered by Windows, OS X, Linux, Android, iOS and Windows Phone and is available in the following languages: English, German, French, Italian, Spanish, Portuguese and Russian.","title":"ShareCAD","source":"http://en.wikipedia.org/wiki/ShareCAD","summary":"ShareCAD or ShareCAD.org is a free online service aimed at viewing different DWG and CAD formats as well as 3D models in a web browser.  The service doesn’t require any installation or registration and enables users to view vector, raster and 3D formats online. ShareCAD also offers its users a free iframe plugin for viewing DWG at a site. The service runs in web browsers powered by Windows, OS X, Linux, Android, iOS and Windows Phone and is available in the following languages: English, German, French, Italian, Spanish, Portuguese and Russian."},"https://en.wikipedia.org/wiki/Hackaday":{"ref":[],"title":"Hackaday","summary":"Hackaday is a Blog which publishes several articles each day about hardware and software hacks. A hack refers to modifications of a product or software as well as the creation of something entirely new for convenience, novelty, functional or creative reasons.Hackaday also has a YouTube channel where it posts projects and how-to videos.","source":"http://en.wikipedia.org/wiki/Hackaday","abstract":"Hackaday is a Blog which publishes several articles each day about hardware and software hacks. A hack refers to modifications of a product or software as well as the creation of something entirely new for convenience, novelty, functional or creative reasons.Hackaday also has a YouTube channel where it posts projects and how-to videos."},"https://en.wikipedia.org/wiki/Tango_(platform)":{"ref":[],"summary":"Tango (formerly named Project Tango in-testing) is a technology platform developed and authored by Google that uses computer vision to enable mobile devices, such as smartphones and tablets, to detect their position relative to the world around them without using GPS or other external signals. This allows application developers to create user experiences that include indoor navigation, 3D mapping, physical space measurement, environmental recognition, augmented reality, and windows into a virtual world.","source":"http://en.wikipedia.org/wiki/Tango_(platform)","abstract":"Tango (formerly named Project Tango in-testing) is a technology platform developed and authored by Google that uses computer vision to enable mobile devices, such as smartphones and tablets, to detect their position relative to the world around them without using GPS or other external signals. This allows application developers to create user experiences that include indoor navigation, 3D mapping, physical space measurement, environmental recognition, augmented reality, and windows into a virtual world. The first product to emerge from ATAP's Skunkworks group, Tango was developed by a team led by computer scientist Johnny Lee, a core contributor to Microsoft's Kinect. In an interview in June 2015, Lee said, \"We're developing the hardware and software technologies to help everything and everyone understand precisely where they are, anywhere.\" Google has produced two devices to demonstrate the Tango technology: the discontinued Peanut phone and the Yellowstone 7-inch tablet. More than 3,000 of these devices had been sold as of June 2015, chiefly to researchers and software developers interested in building applications for the platform. In the summer of 2015, Qualcomm and Intel both announced that they are developing Tango reference devices as models for device manufacturers who use their mobile chipsets. At CES, in January 2016, Google announced a partnership with Lenovo to release a consumer smartphone during the summer of 2016 to feature Tango technology marketed at consumers, noting a less than $500 price-point and a small form factor below 6.5 inches. At the same time, both companies also announced an application incubator to get applications developed to be on the device on launch. At Lenovo Tech World 2016, Lenovo launched the world's first consumer phone based on Tango, as well as releasing it as \"Tango\".","title":"Tango (platform)"},"https://en.wikipedia.org/wiki/Vuzix":{"ref":[],"summary":"Vuzix is an American multinational technology firm headquartered in Rochester, New York. Founded in 1997 by Paul Travers, Vuzix is a supplier of wearable display technology, Virtual Reality and Augmented Reality. Vuzix manufactures and sells computer display devices and software. Vuzix personal display devices are used for mobile and immersive Augmented Reality applications, such as 3D Gaming, Manufacturing training, and Military tactical equipment.","source":"http://en.wikipedia.org/wiki/Vuzix","title":"Vuzix","abstract":"Vuzix is an American multinational technology firm headquartered in Rochester, New York. Founded in 1997 by Paul Travers, Vuzix is a supplier of wearable display technology, Virtual Reality and Augmented Reality. Vuzix manufactures and sells computer display devices and software. Vuzix personal display devices are used for mobile and immersive Augmented Reality applications, such as 3D Gaming, Manufacturing training, and Military tactical equipment."},"https://en.wikipedia.org/wiki/Google_Glass":{"ref":[],"abstract":"Google Glass is an optical head-mounted display designed in the shape of a pair of eyeglasses. It was developed by X (previously Google X) with the mission of producing a ubiquitous computer. Google Glass displayed information in a smartphone-like hands-free format. Wearers communicated with the Internet via natural language voice commands. Google started selling a prototype of Google Glass to qualified \"Glass Explorers\" in the US on April 15, 2013, for a limited period for $1,500, before it became available to the public on May 15, 2014. The headset has received massive criticism and legislative action due to privacy and safety concerns. On January 15, 2015, Google announced that it would stop producing the Google Glass prototype but remained committed to the development of the product. According to Google, Project Glass was ready to \"graduate\" from X, the experimental phase of the project. On December 28, 2015, Google filed a new application with the Federal Communications Commission for a new version of the Google Glass.","title":"Google Glass","summary":"Google Glass is an optical head-mounted display designed in the shape of a pair of eyeglasses. It was developed by X (previously Google X) with the mission of producing a ubiquitous computer. Google Glass displayed information in a smartphone-like hands-free format. Wearers communicated with the Internet via natural language voice commands. Google started selling a prototype of Google Glass to qualified \"Glass Explorers\" in the US on April 15, 2013, for a limited period for $1,500, before it became available to the public on May 15, 2014. The headset has received massive criticism and legislative action due to privacy and safety concerns.","source":"http://en.wikipedia.org/wiki/Google_Glass"},"https://en.wikipedia.org/wiki/CastAR#castAR":{"ref":[]},"https://en.wikipedia.org/wiki/Oculus_Rift":{"ref":[],"title":"Oculus Rift","summary":"The Oculus Rift is a virtual reality headset developed and manufactured by Oculus VR, released on March 28, 2016. Oculus proposed a Kickstarter campaign in 2012 to fund the Rift's development, after being founded as an independent company two months prior. The project proved successful, raising US$2.5 million from the campaign for the development of the product. In March 2014, Facebook purchased Oculus for $2 billion.","source":"http://en.wikipedia.org/wiki/Oculus_Rift","abstract":"The Oculus Rift is a virtual reality headset developed and manufactured by Oculus VR, released on March 28, 2016. Oculus proposed a Kickstarter campaign in 2012 to fund the Rift's development, after being founded as an independent company two months prior. The project proved successful, raising US$2.5 million from the campaign for the development of the product. In March 2014, Facebook purchased Oculus for $2 billion. The Rift has gone through various pre-production models since the Kickstarter campaign, around five of which were demonstrated to the public. Two of these models were shipped to backers, labelled as 'development kits'; the DK1 in mid 2013 and DK2 in mid 2014, to give developers a chance to develop content on time for the Rift's release. However, both were also purchased by a large number of enthusiasts who wished to get an early preview of the technology. The Rift has an OLED display, 1080×1200 resolution per eye, a 90 Hz refresh rate, and 110° field of view. It has integrated headphones which provide a 3D audio effect, rotational and positional tracking. The positional tracking system, called \"Constellation\", is performed by a USB stationary infrared sensor that is picking up light that is emitted by IR LEDs that are integrated into the hmd. The sensor normally sits on the user's desk. This creates 3D space, allowing for the user to use the Rift while sitting, standing, or walking around the same room."},"https://en.wikipedia.org/wiki/Google_Cardboard":{"ref":[],"abstract":"Google Cardboard is a virtual reality (VR) platform developed by Google for use with a head mount for a smartphone. Named for its fold-out cardboard viewer, the platform is intended as a low-cost system to encourage interest and development in VR applications. Users can either build their own viewer from simple, low-cost components using specifications published by Google, or purchase a pre-manufactured one. The viewer is used by placing a smartphone into the back of it and viewing through the lenses in the front. The platform was created by David Coz and Damien Henry, Google engineers at the Google Cultural Institute in Paris, in their 20% \"Innovation Time Off\". It was introduced at the Google I/O 2014 developers conference, where a Cardboard viewer was given away to all attendees. The Cardboard software development kit (SDK) is available for the Android and iOS operating systems; the SDK's VR View allows developers to embed VR content on the web as well as in their mobile apps. Through January 2016, over 5 million Cardboard viewers had shipped and over 1,000 compatible applications had been published. Following the success of the Cardboard platform, Google announced an enhanced VR platform, Daydream, at Google I/O 2016.","summary":"Google Cardboard is a virtual reality (VR) platform developed by Google for use with a head mount for a smartphone. Named for its fold-out cardboard viewer, the platform is intended as a low-cost system to encourage interest and development in VR applications. Users can either build their own viewer from simple, low-cost components using specifications published by Google, or purchase a pre-manufactured one. The viewer is used by placing a smartphone into the back of it and viewing through the lenses in the front.","source":"http://en.wikipedia.org/wiki/Google_Cardboard","title":"Google Cardboard"},"https://en.wikipedia.org/wiki/Samsung_Gear_VR":{"ref":[],"source":"http://en.wikipedia.org/wiki/Samsung_Gear_VR","title":"Samsung Gear VR","summary":"The Samsung Gear VR is a mobile virtual reality headset developed by Samsung Electronics, in collaboration with Oculus, and manufactured by Samsung. The headset was released on 27 November 2015. When in use, a compatible Samsung Galaxy device (Galaxy Note 5, Galaxy S6/S6 Edge/S6 Edge+, or Galaxy S7/S7 Edge) acts as the headset's display and processor, while the Gear VR unit itself acts as the controller, which contains the high field of view, as well as a custom inertial measurement unit, or IMU, for rotational tracking, which connects to the smartphone via micro-USB. This IMU is more accurate and well calibrated with lower latency than internal smartphone IMUs, such as those used for Google Cardboard.","abstract":"The Samsung Gear VR is a mobile virtual reality headset developed by Samsung Electronics, in collaboration with Oculus, and manufactured by Samsung. The headset was released on 27 November 2015. When in use, a compatible Samsung Galaxy device (Galaxy Note 5, Galaxy S6/S6 Edge/S6 Edge+, or Galaxy S7/S7 Edge) acts as the headset's display and processor, while the Gear VR unit itself acts as the controller, which contains the high field of view, as well as a custom inertial measurement unit, or IMU, for rotational tracking, which connects to the smartphone via micro-USB. This IMU is more accurate and well calibrated with lower latency than internal smartphone IMUs, such as those used for Google Cardboard. The Gear VR headset also includes a touchpad and back button on the side, as well as a proximity sensor to detect when the headset is on. The touchpad and button allow for a standard minimum input capability for users to interact with the virtual environments, whereas Google Cardboard devices only feature a button. The Gear VR was first announced in September 2014. To allow developers to create content for the Gear VR and to allow VR and technology enthusiasts to get early access to the technology, Samsung had released two innovator editions of the Gear VR before the consumer version."},"https://en.wikipedia.org/wiki/Apache_Spark":{"ref":[],"source":"http://en.wikipedia.org/wiki/Apache_Spark","summary":"Apache Spark is an open source cluster computing framework. Originally developed at the University of California, Berkeley's AMPLab, the Spark codebase was later donated to the Apache Software Foundation, which has maintained it since. Spark provides an interface for programming entire clusters with implicit data parallelism and fault-tolerance.","abstract":"Apache Spark is an open source cluster computing framework. Originally developed at the University of California, Berkeley's AMPLab, the Spark codebase was later donated to the Apache Software Foundation, which has maintained it since. Spark provides an interface for programming entire clusters with implicit data parallelism and fault-tolerance.","title":"Apache Spark"}}