{"https://en.wikipedia.org/wiki/3D_printing":{"ref":[],"summary":"3D printing, also known as additive manufacturing (AM), refers to various processes used to synthesize a three-dimensional object. In 3D printing, successive layers of material are formed under computer control to create an object. These objects can be of almost any shape or geometry and are produced from a 3D model or other electronic data source. A 3D printer is a type of industrial robot.","abstract":"3D printing, also known as additive manufacturing (AM), refers to various processes used to synthesize a three-dimensional object. In 3D printing, successive layers of material are formed under computer control to create an object. These objects can be of almost any shape or geometry and are produced from a 3D model or other electronic data source. A 3D printer is a type of industrial robot. Futurologists such as Jeremy Rifkin believe that 3D printing signals the beginning of a third industrial revolution, succeeding the production line assembly that dominated manufacturing starting in the late 19th century. Using the power of the Internet, it may eventually be possible to send a blueprint of any product to any place in the world to be replicated by a 3D printer with \"elemental inks\" capable of being combined into any material substance of any desired form. 3D printing in the term's original sense refers to processes that sequentially deposit material onto a powder bed with inkjet printer heads. More recently, the meaning of the term has expanded to encompass a wider variety of techniques such as extrusion and sintering-based processes. Technical standards generally use the term additive manufacturing for this broader sense.","title":"3D printing","source":"http://en.wikipedia.org/wiki/3D_printing"},"https://en.wikipedia.org/wiki/Laser_cutting":{"ref":[],"abstract":"Laser cutting is a technology that uses a laser to cut materials, and is typically used for industrial manufacturing applications, but is also starting to be used by schools, small businesses, and hobbyists. Laser cutting works by directing the output of a high-power laser most commonly through optics. The laser optics and CNC (computer numerical control) are used to direct the material or the laser beam generated. A typical commercial laser for cutting materials would involve a motion control system to follow a CNC or G-code of the pattern to be cut onto the material. The focused laser beam is directed at the material, which then either melts, burns, vaporizes away, or is blown away by a jet of gas, leaving an edge with a high-quality surface finish. Industrial laser cutters are used to cut flat-sheet material as well as structural and piping materials.","source":"http://en.wikipedia.org/wiki/Laser_cutting","title":"Laser cutting","summary":"Laser cutting is a technology that uses a laser to cut materials, and is typically used for industrial manufacturing applications, but is also starting to be used by schools, small businesses, and hobbyists. Laser cutting works by directing the output of a high-power laser most commonly through optics. The laser optics and CNC (computer numerical control) are used to direct the material or the laser beam generated. A typical commercial laser for cutting materials would involve a motion control system to follow a CNC or G-code of the pattern to be cut onto the material. The focused laser beam is directed at the material, which then either melts, burns, vaporizes away, or is blown away by a jet of gas, leaving an edge with a high-quality surface finish. Industrial laser cutters are used to c"},"https://en.wikipedia.org/wiki/Milling_(machining)":{"ref":[],"abstract":"Milling is the machining process of using rotary cutters to remove material from a workpiece advancing (or feeding) in a direction at an angle with the axis of the tool. It covers a wide variety of different operations and machines, on scales from small individual parts to large, heavy-duty gang milling operations. It is one of the most commonly used processes in industry and machine shops today for machining parts to precise sizes and shapes. Milling can be done with a wide range of machine tools. The original class of machine tools for milling was the milling machine (often called a mill). After the advent of computer numerical control (CNC), milling machines evolved into machining centers (milling machines with automatic tool changers, tool magazines or carousels, CNC control, coolant systems, and enclosures), generally classified as vertical machining centers (VMCs) and horizontal machining centers (HMCs). The integration of milling into turning environments and of turning into milling environments, begun with live tooling for lathes and the occasional use of mills for turning operations, led to a new class of machine tools, multitasking machines (MTMs), which are purpose-built to provide for a default machining strategy of using any combination of milling and turning within the same work envelope.","source":"http://en.wikipedia.org/wiki/Milling_(machining)","title":"Milling (machining)","summary":"Milling is the machining process of using rotary cutters to remove material from a workpiece advancing (or feeding) in a direction at an angle with the axis of the tool. It covers a wide variety of different operations and machines, on scales from small individual parts to large, heavy-duty gang milling operations. It is one of the most commonly used processes in industry and machine shops today for machining parts to precise sizes and shapes."},"https://en.wikipedia.org/wiki/3D_modeling":{"ref":[],"title":"3D modeling","summary":"In 3D computer graphics, 3D modeling (or modelling) is the process of developing a mathematical representation of any three-dimensional surface of an object (either inanimate or living) via specialized software. The product is called a 3D model. It can be displayed as a two-dimensional image through a process called 3D rendering or used in a computer simulation of physical phenomena. The model can also be physically created using 3D printing devices.","source":"http://en.wikipedia.org/wiki/3D_modeling","abstract":"In 3D computer graphics, 3D modeling (or modelling) is the process of developing a mathematical representation of any three-dimensional surface of an object (either inanimate or living) via specialized software. The product is called a 3D model. It can be displayed as a two-dimensional image through a process called 3D rendering or used in a computer simulation of physical phenomena. The model can also be physically created using 3D printing devices. Models may be created automatically or manually. The manual modeling process of preparing geometric data for 3D computer graphics is similar to plastic arts such as sculpting. 3D modeling software is a class of 3D computer graphics software used to produce 3D models. Individual programs of this class are called modeling applications or modelers."},"https://en.wikipedia.org/wiki/Fused_deposition_modeling":{"ref":[],"source":"http://en.wikipedia.org/wiki/Fused_deposition_modeling","abstract":"Fused deposition modeling (FDM) is an additive manufacturing technology commonly used for modeling, prototyping, and production applications. It is one of the techniques used for 3D printing. FDM works on an \"additive\" principle by laying down material in layers; a plastic filament or metal wire is unwound from a coil and supplies material to produce a part. The technology was developed by S. Scott Crump in the late 1980s and was commercialized in 1990. The term fused deposition modeling and its abbreviation to FDM are trademarked by Stratasys Inc. The exactly equivalent term, fused filament fabrication (FFF), was coined by the members of the RepRap project to give a phrase that would be legally unconstrained in its use. It is also sometimes called Plastic Jet Printing (PJP).","summary":"Fused deposition modeling (FDM) is an additive manufacturing technology commonly used for modeling, prototyping, and production applications. It is one of the techniques used for 3D printing.FDM works on an \"additive\" principle by laying down material in layers; a plastic filament or metal wire is unwound from a coil and supplies material to produce a part.","title":"Fused deposition modeling"},"https://en.wikipedia.org/wiki/Stereolithography":{"ref":[],"abstract":"Stereolithography (SLA or SL; also known as Optical Fabrication, Photo-Solidification, Solid Free-Form Fabrication, Solid Imaging, Rapid Prototyping, Resin Printing, and 3D printing) is a form of additive manufacturing technology used for creating models, prototypes, patterns, and production parts in a layer by layer fashion using photopolymerization, a process by which light causes chains of molecules to link together, forming polymers. Research in the area had been conducted during the 1970s, but the term was coined by Charles (Chuck) W. Hull in 1986 when he patented the process. He then set up 3D Systems Inc to commercialize his patent.","title":"Stereolithography","summary":"Stereolithography (SLA or SL; also known as Optical Fabrication, Photo-Solidification, Solid Free-Form Fabrication, Solid Imaging, Rapid Prototyping, Resin Printing, and 3D printing) is a form of additive manufacturing technology used for creating models, prototypes, patterns, and production parts in a layer by layer fashion using photopolymerization, a process by which light causes chains of molecules to link together, forming polymers. Research in the area had been conducted during the 1970s, but the term was coined by Charles (Chuck) W. Hull in 1986 when he patented the process. He then set up 3D Systems Inc to commercialize his patent.","source":"http://en.wikipedia.org/wiki/Stereolithography"},"https://en.wikipedia.org/wiki/Selective_laser_sintering":{"ref":[],"source":"http://en.wikipedia.org/wiki/Selective_laser_sintering","summary":"Selective Laser Sintering (SLS) is an additive manufacturing (AM) technique that uses a laser as the power source to sinter powdered material (typically metal), aiming the laser automatically at points in space defined by a 3D model, binding the material together to create a solid structure. It is similar to direct metal laser sintering (DMLS); the two are instantiations of the same concept but differ in technical details. Selective laser melting (SLM) uses a comparable concept, but in SLM the material is fully melted rather than sintered, allowing different properties (crystal structure, porosity, and so on). SLS (as well as the other mentioned AM techniques) is a relatively new technology that so far has mainly been used for rapid prototyping and for low-volume production of component pa","title":"Selective laser sintering","abstract":"Selective Laser Sintering (SLS) is an additive manufacturing (AM) technique that uses a laser as the power source to sinter powdered material (typically metal), aiming the laser automatically at points in space defined by a 3D model, binding the material together to create a solid structure. It is similar to direct metal laser sintering (DMLS); the two are instantiations of the same concept but differ in technical details. Selective laser melting (SLM) uses a comparable concept, but in SLM the material is fully melted rather than sintered, allowing different properties (crystal structure, porosity, and so on). SLS (as well as the other mentioned AM techniques) is a relatively new technology that so far has mainly been used for rapid prototyping and for low-volume production of component parts. Production roles are expanding as the commercialization of AM technology improves."},"https://en.wikipedia.org/wiki/Virtual_touch_screen":{"ref":[],"title":"Virtual touch screen","summary":"A virtual touch screen (VTS) is a user interface system that augments virtual objects into reality either through a projector or optical display using sensors to track a person's interaction with the object. For instance, using a display and a rear projector system a person could create images that look three-dimensional and appear to float in midair. Some systems utilize an optical head-mounted display to augment the virtual objects onto the transparent display utilizing sensors to determine visual and physical interactions with the virtual objects projected.","abstract":"A virtual touch screen (VTS) is a user interface system that augments virtual objects into reality either through a projector or optical display using sensors to track a person's interaction with the object. For instance, using a display and a rear projector system a person could create images that look three-dimensional and appear to float in midair. Some systems utilize an optical head-mounted display to augment the virtual objects onto the transparent display utilizing sensors to determine visual and physical interactions with the virtual objects projected.","source":"http://en.wikipedia.org/wiki/Virtual_touch_screen"},"https://en.wikipedia.org/wiki/Video_hosting_service":{"ref":[],"source":"http://en.wikipedia.org/wiki/Video_hosting_service","abstract":"A video hosting service allows individuals to upload and share personal, business or royalty-free videos and to watch them legally. Users generally will upload via the hosting service's website, mobile or desktop applications or APIs. The type of video content uploaded can be anything from short video clips all the way to full-length movies. The video host will then store the video on its server, and show the individual different types of embed codes or links to allow others to view this video. The website, mainly used as the video hosting website, is usually called the video sharing website.","title":"Video hosting service","summary":"A video hosting service allows individuals to upload and share personal, business orroyalty-free videos and to watch them legally. Users generally will upload via the hosting service's website, mobile or desktop applications or APIs. The type of video content uploaded can be anything from short video clips all the way to full-length movies. The video host will then store the video on its server, and show the individual different types of embed codes or links to allow others to view this video. The website, mainly used as the video hosting website, is usually called the video sharing website."},"https://en.wikipedia.org/wiki/Image_sharing":{"ref":[],"source":"http://en.wikipedia.org/wiki/Image_sharing","title":"Image sharing"},"https://en.wikipedia.org/wiki/Massive_open_online_course":{"ref":[],"title":"Massive open online course","abstract":"A massive open online course (MOOC /muːk/) is an online course aimed at unlimited participation and open access via the web. In addition to traditional course materials such as filmed lectures, readings, and problem sets, many MOOCs provide interactive user forums to support community interactions among students, professors, and teaching assistants (TAs). MOOCs are a recent and widely researched development in distance education which were first introduced in 2008 and emerged as a popular mode of learning in 2012. Early MOOCs often emphasized open-access features, such as open licensing of content, structure and learning goals, to promote the reuse and remixing of resources. Some later MOOCs use closed licenses for their course materials while maintaining free access for students. Robert Zemsky (2014) argues that they have passed their peak: \"They came; they conquered very little; and now they face substantially diminished prospects.\"","summary":"A massive open online course (MOOC /muːk/) is an online course aimed at unlimited participation and open access via the web. In addition to traditional course materials such as filmed lectures, readings, and problem sets, many MOOCs provide interactive user forums to support community interactions among students, professors, and teaching assistants (TAs). MOOCs are a recent and widely researched development in distance education which were first introduced in 2008 and emerged as a popular mode of learning in 2012.","source":"http://en.wikipedia.org/wiki/Massive_open_online_course"},"https://en.wikipedia.org/wiki/Podcast":{"ref":[],"title":"Podcast","summary":"A podcast is a form of digital media that consists of an episodic series of audio, video, digital radio, PDF, or ePub files subscribed to and downloaded through web syndication or streamed online to a computer or mobile device. The word is a portmanteau of \"(i)Pod\" and \"broadcast.\"The Merriam Webster Tenth International Collegiate defines \"podcast\" as: a program (as of music or talk) made available in digital format for automatic download over the Internet.","abstract":"A podcast is a form of digital media that consists of an episodic series of audio, video, digital radio, PDF, or ePub files subscribed to and downloaded through web syndication or streamed online to a computer or mobile device. The word is a portmanteau of \"(i)Pod\" and \"broadcast.\" The Merriam Webster Tenth International Collegiate defines \"podcast\" as: a program (as of music or talk) made available in digital format for automatic download over the Internet. A podcast's distributor maintains a list of audio or video files in a series on a server as a web feed, and the listener or viewer uses special client application software, known as a podcatcher, to access this web feed, check it for updates, and download any new files in the series. This process can be automated so that new files are downloaded automatically, which may seem to the user as if the content is being broadcast or \"pushed\" to them. Files are stored locally on the user's computer or other device, ready for offline use. Podcasting contrasts with webcasting (Internet streaming), which generally isn't designed for offline listening to user-selected content. As discussed by Richard Berry, podcasting is both a converged medium bringing together audio, the web, and portable media player, and a disruptive technology that has caused some in the radio business to reconsider established practices and preconceptions about audiences, consumption, production, and distribution. This is largely because no one person owns the technology; it is free to listen and create content, which departs from the traditional model of \"gate-kept\" media and production tools. It is very much a horizontal media form: producers are consumers and consumers become producers and engage in conversations with each other.","source":"http://en.wikipedia.org/wiki/Podcast"},"https://en.wikipedia.org/wiki/Dataflow_programming":{"ref":[],"summary":"In computer programming, dataflow programming is a programming paradigm that models a program as a directed graph of the data flowing between operations, thus implementing dataflow principles and architecture. Dataflow programming languages share some features of functional languages, and were generally developed in order to bring some functional concepts to a language more suitable for numeric processing. Some authors use the term Datastream instead of Dataflow to avoid confusion with Dataflow Computing or Dataflow architecture, based on an indeterministic machine paradigm. Dataflow programming was pioneered by Jack Dennis and his graduate students at MIT in the 1960s.","source":"http://en.wikipedia.org/wiki/Dataflow_programming","abstract":"In computer programming, dataflow programming is a programming paradigm that models a program as a directed graph of the data flowing between operations, thus implementing dataflow principles and architecture. Dataflow programming languages share some features of functional languages, and were generally developed in order to bring some functional concepts to a language more suitable for numeric processing. Some authors use the term Datastream instead of Dataflow to avoid confusion with Dataflow Computing or Dataflow architecture, based on an indeterministic machine paradigm. Dataflow programming was pioneered by Jack Dennis and his graduate students at MIT in the 1960s.","title":"Dataflow programming"},"https://en.wikipedia.org/wiki/Mixed_reality":{"ref":[],"summary":"Mixed reality (MR), sometimes referred to as hybrid reality, is the merging of real and virtual worlds to produce new environments and visualizations where physical and digital objects co-exist and interact in real time. Mixed reality takes place not only in the physical world or the virtual world, but is a mix of reality and virtual reality, encompassing both augmented reality and augmented virtuality.","source":"http://en.wikipedia.org/wiki/Mixed_reality","abstract":"Mixed reality (MR), sometimes referred to as hybrid reality, is the merging of real and virtual worlds to produce new environments and visualizations where physical and digital objects co-exist and interact in real time. Mixed reality takes place not only in the physical world or the virtual world, but is a mix of reality and virtual reality, encompassing both augmented reality and augmented virtuality.","title":"Mixed reality"},"https://en.wikipedia.org/wiki/Platform_as_a_service":{"ref":[],"source":"http://en.wikipedia.org/wiki/Platform_as_a_service","abstract":"Platform as a service (PaaS) is a category of cloud computing services that provides a platform allowing customers to develop, run, and manage applications without the complexity of building and maintaining the infrastructure typically associated with developing and launching an app. PaaS can be delivered in two ways: as a public cloud service from a provider, where the consumer controls software deployment and configuration settings, and the provider provides the networks, servers, storage and other services to host the consumer's application; or as software installed in private data centers or public infrastructure as a service and managed by internal IT departments.","summary":"Platform as a service (PaaS) is a category of cloud computing services that provides a platform allowing customers to develop, run, and manage applications without the complexity of building and maintaining the infrastructure typically associated with developing and launching an app. PaaS can be delivered in two ways: as a public cloud service from a provider, where the consumer controls software deployment and configuration settings, and the provider provides the networks, servers, storage and other services to host the consumer's application; or as software installed in private data centers or public infrastructure as a service and managed by internal IT departments.","title":"Platform as a service"},"https://en.wikipedia.org/wiki/Software_as_a_service":{"ref":[],"summary":"Software as a service (SaaS; pronounced /sæs/) is a software licensing and delivery model in which software is licensed on a subscription basis and is centrally hosted. It is sometimes referred to as \"on-demand software\". SaaS is typically accessed by users using a thin client via a web browser. SaaS has become a common delivery model for many business applications, including office and messaging software, payroll processing software, DBMS software, management software, CAD software, development software, gamification, virtualization, accounting, collaboration, customer relationship management (CRM), management information systems (MIS), enterprise resource planning (ERP), invoicing, human resource management (HRM), talent acquisition, content management (CM), antivirus software, and servi","abstract":"Software as a service (SaaS; pronounced /sæs/) is a software licensing and delivery model in which software is licensed on a subscription basis and is centrally hosted. It is sometimes referred to as \"on-demand software\". SaaS is typically accessed by users using a thin client via a web browser. SaaS has become a common delivery model for many business applications, including office and messaging software, payroll processing software, DBMS software, management software, CAD software, development software, gamification, virtualization, accounting, collaboration, customer relationship management (CRM), management information systems (MIS), enterprise resource planning (ERP), invoicing, human resource management (HRM), talent acquisition, content management (CM), antivirus software, and service desk management. SaaS has been incorporated into the strategy of all leading enterprise software companies.[citation needed] One of the biggest selling points for these companies is the potential to reduce IT support costs by outsourcing hardware and software maintenance and support to the SaaS provider.[citation needed] According to a Gartner Group estimate, SaaS sales in 2010 reached $10 billion, and were projected to increase to $12.1bn in 2011, up 20.7% from 2010. Gartner Group estimates that SaaS revenue will be more than double its 2010 numbers by 2015 and reach a projected $21.3bn. Customer relationship management (CRM) continues to be the largest market for SaaS. SaaS revenue within the CRM market was forecast to reach $3.8bn in 2011, up from $3.2bn in 2010. The term \"software as a service\" (SaaS) is considered to be part of the nomenclature of cloud computing, along with infrastructure as a service (IaaS), platform as a service (PaaS), desktop as a service (DaaS), managed software as a service (MSaaS), mobile backend as a service (MBaaS), and information technology management as a service (ITMaaS).","title":"Software as a service","source":"http://en.wikipedia.org/wiki/Software_as_a_service"},"https://en.wikipedia.org/wiki/Peer-to-peer":{"ref":[],"source":"http://en.wikipedia.org/wiki/Peer-to-peer","abstract":"Peer-to-peer (P2P) computing or networking is a distributed application architecture that partitions tasks or work loads between peers. Peers are equally privileged, equipotent participants in the application. They are said to form a peer-to-peer network of nodes. Peers make a portion of their resources, such as processing power, disk storage or network bandwidth, directly available to other network participants, without the need for central coordination by servers or stable hosts. Peers are both suppliers and consumers of resources, in contrast to the traditional client-server model in which the consumption and supply of resources is divided. Emerging collaborative P2P systems are going beyond the era of peers doing similar things while sharing resources, and are looking for diverse peers that can bring in unique resources and capabilities to a virtual community thereby empowering it to engage in greater tasks beyond those that can be accomplished by individual peers, yet that are beneficial to all the peers. While P2P systems had previously been used in many application domains, the architecture was popularized by the file sharing system Napster, originally released in 1999. The concept has inspired new structures and philosophies in many areas of human interaction. In such social contexts, peer-to-peer as a meme refers to the egalitarian social networking that has emerged throughout society, enabled by Internet technologies in general.","title":"Peer-to-peer","summary":"Peer-to-peer (P2P) computing or networking is a distributed application architecture that partitions tasks or work loads between peers. Peers are equally privileged, equipotent participants in the application. They are said to form a peer-to-peer network of nodes."},"https://en.wikipedia.org/wiki/Grid_computing":{"ref":[],"title":"Grid computing","abstract":"Grid computing is the collection of computer resources from multiple locations to reach a common goal. The grid can be thought of as a distributed system with non-interactive workloads that involve a large number of files. Grid computing is distinguished from conventional high performance computing systems such as cluster computing in that grid computers have each node set to perform a different task/application.[better source needed] Grid computers also tend to be more heterogeneous and geographically dispersed (thus not physically coupled) than cluster computers. Although a single grid can be dedicated to a particular application, commonly a grid is used for a variety of purposes. Grids are often constructed with general-purpose grid middleware software libraries. Grid sizes can be quite large. Grids are a form of distributed computing whereby a “super virtual computer” is composed of many networked loosely coupled computers acting together to perform large tasks. For certain applications, “distributed” or “grid” computing, can be seen as a special type of parallel computing that relies on complete computers (with onboard CPUs, storage, power supplies, network interfaces, etc.) connected to a computer network (private or public) by a conventional network interface, such as Ethernet. This is in contrast to the traditional notion of a supercomputer, which has many processors connected by a local high-speed computer bus.","source":"http://en.wikipedia.org/wiki/Grid_computing","summary":"Grid computing is the collection of computer resources from multiple locations to reach a common goal. The grid can be thought of as a distributed system with non-interactive workloads that involve a large number of files. Grid computing is distinguished from conventional high performance computing systems such as cluster computing in that grid computers have each node set to perform a different task/application.[better source needed] Grid computers also tend to be more heterogeneous and geographically dispersed (thus not physically coupled) than cluster computers. Although a single grid can be dedicated to a particular application, commonly a grid is used for a variety of purposes. Grids are often constructed with general-purpose grid middleware software libraries. Grid sizes can be quite"},"https://en.wikipedia.org/wiki/Fog_computing":{"ref":[],"abstract":"Fog computing or fog networking, also known as fogging, is an architecture that uses one or a collaborative multitude of end-user clients or near-user edge devices to carry out a substantial amount of storage (rather than stored primarily in cloud data centers), communication (rather than routed over the internet backbone), and control, configuration, measurement and management (rather than controlled primarily by network gateways such as those in the LTE (telecommunication) core). Fog computing can be perceived both in large cloud systems and big data structures, making reference to the growing difficulties in accessing information objectively. This results in a lack of quality of the obtained content. The effects of fog computing on cloud computing and big data systems may vary; yet, a common aspect that can be extracted is a limitation in accurate content distribution, an issue that has been tackled with the creation of metrics that attempt to improve accuracy. Fog networking consists of a control plane and a data plane. For example, on the data plane, fog computing enables computing services to reside at the edge of the network as opposed to servers in a data-center. Compared to cloud computing, fog computing emphasizes proximity to end-users and client objectives, dense geographical distribution and local resource pooling, latency reduction for quality of service (QoS) and edge analytics/stream mining, resulting in superior user-experience and redundancy in case of failure. Fog networking supports the Internet of Everything (IoE), in which most of the devices that we use on a daily basis will be connected to each other. Examples include our phones, wearable health monitoring devices, connected vehicle and augmented reality using devices such as the Google Glass. ISO/IEC 20248 provides a method whereby the data of objects identified by edge computing using Automated Identification Data Carriers [AIDC], a barcode and/or RFID tag, can be read, interpreted, verified and made available into the \"Fog\" and on the \"Edge\" even when the AIDC tag has moved on.","source":"http://en.wikipedia.org/wiki/Fog_computing","summary":"Fog computing or fog networking, also known as fogging, is an architecture that uses one or a collaborative multitude of end-user clients or near-user edge devices to carry out a substantial amount of storage (rather than stored primarily in cloud data centers), communication (rather than routed over the internet backbone), and control, configuration, measurement and management (rather than controlled primarily by network gateways such as those in the LTE (telecommunication) core).","title":"Fog computing"},"https://en.wikipedia.org/wiki/Cave_automatic_virtual_environment":{"ref":[],"title":"Cave automatic virtual environment","abstract":"A cave automatic virtual environment (better known by the acronym CAVE) is an immersive virtual reality environment where projectors are directed to between three and six of the walls of a room-sized cube. The name is also a reference to the allegory of the Cave in Plato's Republic in which a philosopher contemplates perception, reality and illusion.","summary":"A cave automatic virtual environment (better known by the acronym CAVE) is an immersive virtual reality environment where projectors are directed to between three and six of the walls of a room-sized cube. The name is also a reference to the allegory of the Cave in Plato's Republic in which a philosopher contemplates perception, reality and illusion.","source":"http://en.wikipedia.org/wiki/Cave_automatic_virtual_environment"},"https://en.wikipedia.org/wiki/Kinect":{"ref":[],"summary":"Kinect (codenamed in development as Project Natal) is a line of motion sensing input devices by Microsoft for Xbox 360 and Xbox One video game consoles and Windows PCs. Based around a webcam-style add-on peripheral, it enables users to control and interact with their console/computer without the need for a game controller, through a natural user interface using gestures and spoken commands. The first-generation Kinect was first introduced in November 2010 in an attempt to broaden Xbox 360's audience beyond its typical gamer base. A version for Windows was released on February 1, 2012. Kinect competes with several motion controllers on other home consoles, such as Wii Remote Plus for Wii and Wii U, PlayStation Move/PlayStation Eye for PlayStation 3, and PlayStation Camera for PlayStation 4.","title":"Kinect","source":"http://en.wikipedia.org/wiki/Kinect","abstract":"Kinect (codenamed in development as Project Natal) is a line of motion sensing input devices by Microsoft for Xbox 360 and Xbox One video game consoles and Windows PCs. Based around a webcam-style add-on peripheral, it enables users to control and interact with their console/computer without the need for a game controller, through a natural user interface using gestures and spoken commands. The first-generation Kinect was first introduced in November 2010 in an attempt to broaden Xbox 360's audience beyond its typical gamer base. A version for Windows was released on February 1, 2012. Kinect competes with several motion controllers on other home consoles, such as Wii Remote Plus for Wii and Wii U, PlayStation Move/PlayStation Eye for PlayStation 3, and PlayStation Camera for PlayStation 4. Microsoft released the Kinect software development kit for Windows 7 on June 16, 2011. This SDK was meant to allow developers to write Kinecting apps in C++/CLI, C#, or Visual Basic .NET."},"https://en.wikipedia.org/wiki/Microsoft_HoloLens":{"ref":[],"title":"Microsoft HoloLens","source":"http://en.wikipedia.org/wiki/Microsoft_HoloLens"},"https://en.wikipedia.org/wiki/IFTTT":{"ref":[],"summary":"IFTTT is a free web-based service that allows users to create chains of simple conditional statements, called \"recipes\", which are triggered based on changes to other web services such as Gmail, Facebook, Instagram, and Pinterest. IFTTT is an abbreviation of \"If This Then That\".An example \"recipe\" might consist of sending an e-mail message if the IFTTT user tweets using a certain hashtag. Or, if the user is tagged by someone on Facebook, then that photo will be added to the user's cloud-based photo archive.","title":"IFTTT","source":"http://en.wikipedia.org/wiki/IFTTT","abstract":"IFTTT is a free web-based service that allows users to create chains of simple conditional statements, called \"recipes\", which are triggered based on changes to other web services such as Gmail, Facebook, Instagram, and Pinterest. IFTTT is an abbreviation of \"If This Then That\". An example \"recipe\" might consist of sending an e-mail message if the IFTTT user tweets using a certain hashtag. Or, if the user is tagged by someone on Facebook, then that photo will be added to the user's cloud-based photo archive. IFTTT was created by Linden Tibbets, Jesse Tane, Scott Tong and Alexander Tibbets in San Francisco, California. IFTTT was launched in September 7, 2011. Today, IFTTT recipes are widely used and shared by its users. In addition to its web-based application, IFTTT for iPhone was launched on July 10, 2013 and contained three channels: iOS Photos, Reminders and Contacts. An iPad version with iOS notification support was later introduced on April 3, 2014. Later that month, on April 24, 2014, IFTTT released an Android version of the app. On February 19, 2015, IFTTT renamed their original application to IF and released a new suite of apps called Do. The Do apps allow users to create customizable shortcut applications and actions. Linden Tibbets also announced that IFTTT users are now \"cooking\" about 20 million \"recipes\" each day."}}