{"head":{"link":[],"vars":["s","p","o"]},"results":{"distinct":false,"ordered":true,"bindings":[{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/1999/02/22-rdf-syntax-ns#type"},"o":{"type":"uri","value":"http://dbpedia.org/class/yago/OpticalDevice103851341"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://purl.org/dc/terms/subject"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Category:Laser_applications"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#comment"},"o":{"type":"literal","value":"Lasersnijden is een industriële bewerkingstechniek.Een laser is een elektromagnetische stralingsbron die licht uitzendt in een bijna evenwijdige bundel. Om met de laserstraal te kunnen snijden, moet die worden gefocusseerd tot een lichtcirkel waarvan de diameter slechts fracties van een millimeter bedraagt. Hierdoor wordt de intensiteit van de straal zo groot, dat door smelten en verdampen van het materiaal zeer smalle en nauwkeurige gleuven kunnen worden gemaakt. Met de scherpe laserstraal kan men een groot aantal metalen en niet-metalen zoals kunststoffen, glas, hout en textiel snijden. Lasersnijden van metaal kan vanaf een vermogen van 100 watt. Voor het snijden van niet-metalen is 12 watt al voldoende.","lang":"nl"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Yamazaki_Mazak_Corporation"},"p":{"type":"uri","value":"http://dbpedia.org/property/products"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser-microjet"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageRedirects"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/abstract"},"o":{"type":"literal","value":"Лазерная резка — технология резки и раскроя материалов, использующая лазер высокой мощности и обычно применяемая на промышленных производственных линиях. Сфокусированный лазерный луч, обычно управляемый компьютером, обеспечивает высокую концентрацию энергии и позволяет разрезать практически любые материалы независимо от их теплофизических свойств. В процессе резки, под воздействием лазерного луча материал разрезаемого участка плавится, возгорается, испаряется или выдувается струей газа. При этом можно получить узкие резы с минимальной зоной термического влияния. Лазерная резка отличается отсутствием механического воздействия на обрабатываемый материал, возникают минимальные деформации, как временные в процессе резки, так и остаточные после полного остывания. Вследствие этого лазерную резку, даже легкодеформируемых и нежестких заготовок и деталей, можно осуществлять с высокой степенью точности. Благодаря большой мощности лазерного излучения обеспечивается высокая производительность процесса в сочетании с высоким качеством поверхностей реза. Легкое и сравнительно простое управление лазерным излучением позволяет осуществлять лазерную резку по сложному контуру плоских и объемных деталей и заготовок с высокой степенью автоматизации процесса.","lang":"ru"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/abstract"},"o":{"type":"literal","value":"القطع بالليزر (Laser cutting) هي تكنولوجيا تستخدم الليزر لقطع المواد، وعادة ما تستخدم في التطبيقات الصناعية، ولكنه بدأ استخدامها أيضا  من قبل المدارس، والشركات الصغيرة والهواة. القطع بالليزر باستخدام الكمبيوتر لتوجيه أشعة الليزر عالية الطاقة إلى المادة التي يراد قطعها. المواد إما أن تذوب، أو تحروق، أو تتبخر على شكل غاز، تاركة الحواف المقطوعة على درجة عالية من الدقة. تستخدم قواطع الليزر الصناعية لقطع مواد مستوية أو  اسطوانية.","lang":"ar"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/abstract"},"o":{"type":"literal","value":"Laser cutting is a technology that uses a laser to cut materials, and is typically used for industrial manufacturing applications, but is also starting to be used by schools, small businesses, and hobbyists. Laser cutting works by directing the output of a high-power laser most commonly through optics. The laser optics and CNC (computer numerical control) are used to direct the material or the laser beam generated. A typical commercial laser for cutting materials would involve a motion control system to follow a CNC or G-code of the pattern to be cut onto the material. The focused laser beam is directed at the material, which then either melts, burns, vaporizes away, or is blown away by a jet of gas, leaving an edge with a high-quality surface finish. Industrial laser cutters are used to cut flat-sheet material as well as structural and piping materials.","lang":"en"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/abstract"},"o":{"type":"literal","value":"Laserschneiden, auch Laserstrahlschneiden ist ein thermisches Trennverfahren für plattenförmiges Material (meist Metallbleche, aber auch Holzplatten und organische Materialien) und 3-dimensionale Körper (z. B. Rohre oder Profile) mittels eines Lasers. Das Verfahren wird dort eingesetzt, wo komplexe Umrisse (zwei- oder auch dreidimensional), eine präzise, schnelle Verarbeitung (typisch 10 m/min, aber auch bis über 100 m/min), die Herstellung dreidimensionaler Durchbrüche (auch an schlecht zugänglichen Stellen) oder/und eine berührungslose, nahezu kraftfreie Bearbeitung gefordert sind. Gegenüber alternativen Verfahren wie etwa dem Stanzen ist das Laserschneiden bereits bei sehr niedrigen Losgrößen wirtschaftlich einsetzbar. Um die Vorteile des Laserschneidens mit denen des Nibbelns und Stanzens zu kombinieren, bieten die Hersteller auch kombinierte Maschinen an, die sowohl Operationen mit dem Stanzkopf als auch das Auslasern beliebiger Konturen ermöglichen. Zum Einsatz kommen fokussierte Hochleistungslaser, meist der CO2-Laser (ein Gaslaser) oder auch zunehmend Nd:YAG-Laser (Festkörperlaser) sowie die effizienteren, gut fokussierbaren Faserlaser.","lang":"de"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2002/07/owl#sameAs"},"o":{"type":"uri","value":"http://nl.dbpedia.org/resource/Lasersnijden"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#label"},"o":{"type":"literal","value":"Lasersnijden","lang":"nl"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2002/07/owl#sameAs"},"o":{"type":"uri","value":"http://id.dbpedia.org/resource/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Trotec"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/product"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2002/07/owl#sameAs"},"o":{"type":"uri","value":"http://rdf.freebase.com/ns/m.02m859"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://xmlns.com/foaf/0.1/isPrimaryTopicOf"},"o":{"type":"uri","value":"http://en.wikipedia.org/wiki/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/thumbnail"},"o":{"type":"uri","value":"http://commons.wikimedia.org/wiki/Special:FilePath/LaserCutter.jpg?width=300"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/1999/02/22-rdf-syntax-ns#type"},"o":{"type":"uri","value":"http://dbpedia.org/class/yago/PhysicalEntity100001930"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/abstract"},"o":{"type":"literal","value":"Lasersnijden is een industriële bewerkingstechniek. Een laser is een elektromagnetische stralingsbron die licht uitzendt in een bijna evenwijdige bundel. Om met de laserstraal te kunnen snijden, moet die worden gefocusseerd tot een lichtcirkel waarvan de diameter slechts fracties van een millimeter bedraagt. Hierdoor wordt de intensiteit van de straal zo groot, dat door smelten en verdampen van het materiaal zeer smalle en nauwkeurige gleuven kunnen worden gemaakt. Met de scherpe laserstraal kan men een groot aantal metalen en niet-metalen zoals kunststoffen, glas, hout en textiel snijden. Lasersnijden van metaal kan vanaf een vermogen van 100 watt. Voor het snijden van niet-metalen is 12 watt al voldoende. Behalve voor het lasersnijden worden lasers in de industrie ook voor andere bewerkingen gebruikt. Lasers worden ook gebruikt voor het graveren en lassen van onderdelen en voor oppervlaktebehandelingen zoals harden. De laserstraal kan door zijn straalkwaliteit ver worden getransporteerd. De laserbron en de werkplek kunnen dus ver van elkaar worden opgesteld. Pas op de werkplek wordt de straal dan gefocusseerd. Met behulp van spiegels is het ook mogelijk om met één laserbron afwisselend op verschillende werkplekken te werken, en daarbij zelfs ook afwisselend te lassen en te snijden. De snijsnelheid die bij het lasersnijden gehaald kan worden is afhankelijk van een aantal variabelen, zoals het materiaal, de dikte, het type laser en het vermogen. De snelheid varieert ruwweg tussen de 0,5 (bij staal) en 12 (bij kunststof) meter per minuut.","lang":"nl"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/1999/02/22-rdf-syntax-ns#type"},"o":{"type":"uri","value":"http://dbpedia.org/class/yago/Machine103699975"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://purl.org/dc/terms/subject"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Category:Cutting_machines"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2002/07/owl#sameAs"},"o":{"type":"uri","value":"http://pl.dbpedia.org/resource/Cięcie_laserowe"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2002/07/owl#sameAs"},"o":{"type":"uri","value":"http://ja.dbpedia.org/resource/レーザ切断"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/1999/02/22-rdf-syntax-ns#type"},"o":{"type":"uri","value":"http://dbpedia.org/class/yago/Laser103643253"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#comment"},"o":{"type":"literal","value":"القطع بالليزر (Laser cutting) هي تكنولوجيا تستخدم الليزر لقطع المواد، وعادة ما تستخدم في التطبيقات الصناعية، ولكنه بدأ استخدامها أيضا  من قبل المدارس، والشركات الصغيرة والهواة. القطع بالليزر باستخدام الكمبيوتر لتوجيه أشعة الليزر عالية الطاقة إلى المادة التي يراد قطعها. المواد إما أن تذوب، أو تحروق، أو تتبخر على شكل غاز، تاركة الحواف المقطوعة على درجة عالية من الدقة. تستخدم قواطع الليزر الصناعية لقطع مواد مستوية أو  اسطوانية.","lang":"ar"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cut"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageRedirects"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/1999/02/22-rdf-syntax-ns#type"},"o":{"type":"uri","value":"http://dbpedia.org/class/yago/WikicatCuttingMachines"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Cutting_laser"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageRedirects"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageID"},"o":{"type":"literal","value":531911,"datatype":"http://www.w3.org/2001/XMLSchema#integer"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#comment"},"o":{"type":"literal","value":"La découpe laser est un procédé de fabrication qui consiste à découper la matière grâce à une grande quantité d’énergie générée par un laser et concentrée sur une très faible surface. Cette technologie est majoritairement destinée aux chaînes de production industrielles, mais peut également convenir aux boutiques, aux établissements professionnels et aux tiers-lieux de fabrication.Le laser peut être pulsé (source de type YAG), continu (source CO2) ou azote.","lang":"fr"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#label"},"o":{"type":"literal","value":"Лазерная резка","lang":"ru"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#label"},"o":{"type":"literal","value":"القطع بالليزر","lang":"ar"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/abstract"},"o":{"type":"literal","value":"El corte con láser es una técnica empleada para cortar piezas de chapa caracterizada en que su fuente de energía es un láser que concentra luz en la superficie de trabajo. Para poder evacuar el material cortado es necesario el aporte de un gas a presión como por ejemplo oxígeno, nitrógeno o argón. Es especialmente adecuado para el corte previo y para el recorte de material sobrante pudiendo desarrollar contornos complicados en las piezas. Entre las principales ventajas de este tipo de fabricación de piezas se puede mencionar que no es necesario disponer de matrices de corte y permite efectuar ajustes de silueta. También entre sus ventajas se puede mencionar que el accionamiento es robotizado para poder mantener constante la distancia entre el electrodo y la superficie exterior de la pieza. Para destacar como puntos desfavorables se puede mencionar que este procedimiento requiere una alta inversión en maquinaria y cuanto más conductor del calor sea el material, mayor dificultad habrá para cortar. El láser afecta térmicamente al metal pero si la graduación es la correcta no deja rebaba. Las piezas a trabajar se prefieren opacas y no pulidas porque reflejan menos. Los espesores más habituales varían entre los 0,5 y 6 mm para acero y aluminio. Los potencias más habituales para este método oscilan entre 3000 y 5000 W. El corte por haz láser (LBC) es un proceso de corte térmico que utiliza fundición o vaporización altamente localizada para cortar el metal con el calor de un haz de luz coherente, generalmente con la asistencia de un gas de alta presión. Se utiliza un gas de asistencia para eliminar los materiales fundidos y volatilizados de la trayectoria del rayo láser. Con el proceso de rayo láser pueden cortarse materiales metálicos y no metálicos. El haz de salida con frecuencia se pulsa a potencias máximas muy altas en el proceso de corte, aumentando la velocidad de propagación de la operación de corte. Los dos tipos más comunes de láser industrial son dióxido de carbono (CO2) y granate de Aluminio de itrio dopado con neodimio (Nd:YAG). Un láser CO2 utiliza un medio gaseoso para producir la acción láser mientras que el Nd:YAG utiliza un material cristalino. El láser CO2 está disponible comercialmente en potencias de hasta 6kW y los sistemas Nd:YAG están disponibles en hasta 6kW. Si se realiza con equipo mecanizado, los cortes láser brindan resultados altamente reproducibles con anchuras de ranuras angostas, mínimas zonas afectadas por el calor y prácticamente ninguna distorsión. El proceso es flexible, fácil de automatizar y ofrece altas velocidades de corte con excelente calidad, pues el láser tiene la capacidad de operar perfiles de corte muy complejos y con radios de curvatura muy pequeños. Además, es una tecnología limpia, no contamina ni utiliza sustancias químicas. Los costos del equipo son altos pero están bajando a medida que la tecnología de resonadores es menos costosa.","lang":"es"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#comment"},"o":{"type":"literal","value":"Laserschneiden, auch Laserstrahlschneiden ist ein thermisches Trennverfahren für plattenförmiges Material (meist Metallbleche, aber auch Holzplatten und organische Materialien) und 3-dimensionale Körper (z. B. Rohre oder Profile) mittels eines Lasers.Um die Vorteile des Laserschneidens mit denen des Nibbelns und Stanzens zu kombinieren, bieten die Hersteller auch kombinierte Maschinen an, die sowohl Operationen mit dem Stanzkopf als auch das Auslasern beliebiger Konturen ermöglichen.","lang":"de"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/abstract"},"o":{"type":"literal","value":"La découpe laser est un procédé de fabrication qui consiste à découper la matière grâce à une grande quantité d’énergie générée par un laser et concentrée sur une très faible surface. Cette technologie est majoritairement destinée aux chaînes de production industrielles, mais peut également convenir aux boutiques, aux établissements professionnels et aux tiers-lieux de fabrication. Les performances de la découpe laser sont en constante évolution : diversification des matériaux, augmentation de l'épaisseur de la découpe, finalisation du rendu. Ces critères d’amélioration sont liés notamment aux progrès réalisés en matière de sources laser. Le laser peut être pulsé (source de type YAG), continu (source CO2) ou azote.","lang":"fr"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageRevisionID"},"o":{"type":"literal","value":703380674,"datatype":"http://www.w3.org/2001/XMLSchema#integer"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://purl.org/dc/terms/subject"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Category:Articles_containing_video_clips"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2002/07/owl#sameAs"},"o":{"type":"uri","value":"http://es.dbpedia.org/resource/Corte_con_láser"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#comment"},"o":{"type":"literal","value":"El corte con láser es una técnica empleada para cortar piezas de chapa caracterizada en que su fuente de energía es un láser que concentra luz en la superficie de trabajo. Para poder evacuar el material cortado es necesario el aporte de un gas a presión como por ejemplo oxígeno, nitrógeno o argón. Es especialmente adecuado para el corte previo y para el recorte de material sobrante pudiendo desarrollar contornos complicados en las piezas. Entre las principales ventajas de este tipo de fabricación de piezas se puede mencionar que no es necesario disponer de matrices de corte y permite efectuar ajustes de silueta. También entre sus ventajas se puede mencionar que el accionamiento es robotizado para poder mantener constante la distancia entre el electrodo y la superficie exterior de la pieza.","lang":"es"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#label"},"o":{"type":"literal","value":"Laser cutting","lang":"en"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/ns/prov#wasDerivedFrom"},"o":{"type":"uri","value":"http://en.wikipedia.org/wiki/Laser_cutting?oldid=703380674"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://xmlns.com/foaf/0.1/depiction"},"o":{"type":"uri","value":"http://commons.wikimedia.org/wiki/Special:FilePath/LaserCutter.jpg"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Yamazaki_Mazak_Corporation"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/product"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#comment"},"o":{"type":"literal","value":"レーザ切断（レーザせつだん、英語: Laser cutting）とは、レーザーのエネルギーによって溶融、切断する加工法の総称。レーザ発振器から反射鏡などを用いて伝送されてきたレーザーを集光レンズで細く絞って試料に照射することで局部的に溶融させ、レーザーと同軸に配置したノズルからアシストガスを噴き付けて、溶融物を噴き飛ばし、切断する。金属はもちろん、セラミックス、樹脂、複合材の切断も行うことができる。また、切断カーフが小さいので、精度の良い切断が可能である。レーザーを用いた切断加工（穴あけ加工）は産業界で最も早くから取り入れられ、板金材の切断用として広く定着したレーザー加工法のひとつ。近年、より厚い板の切断の普及や高速化が進み、レーザー切断の加工範囲は更に広がっている。他のどの切断加工方法よりも、広範な種類の材料を自由な形に、高速・高精度で切断加工できることと、美しい仕上がりの実現できることで、幅広い産業で取り入れられている。","lang":"ja"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2002/07/owl#sameAs"},"o":{"type":"uri","value":"http://fr.dbpedia.org/resource/Découpe_laser"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2002/07/owl#sameAs"},"o":{"type":"uri","value":"http://www.wikidata.org/entity/Q593053"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#comment"},"o":{"type":"literal","value":"Laser cutting is a technology that uses a laser to cut materials, and is typically used for industrial manufacturing applications, but is also starting to be used by schools, small businesses, and hobbyists. Laser cutting works by directing the output of a high-power laser most commonly through optics. The laser optics and CNC (computer numerical control) are used to direct the material or the laser beam generated. A typical commercial laser for cutting materials would involve a motion control system to follow a CNC or G-code of the pattern to be cut onto the material. The focused laser beam is directed at the material, which then either melts, burns, vaporizes away, or is blown away by a jet of gas, leaving an edge with a high-quality surface finish. Industrial laser cutters are used to c","lang":"en"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/1999/02/22-rdf-syntax-ns#type"},"o":{"type":"uri","value":"http://dbpedia.org/class/yago/Whole100003553"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#label"},"o":{"type":"literal","value":"Cięcie laserowe","lang":"pl"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#label"},"o":{"type":"literal","value":"レーザ切断","lang":"ja"}},{"s":{"type":"uri","value":"http://en.wikipedia.org/wiki/Laser_cutting"},"p":{"type":"uri","value":"http://xmlns.com/foaf/0.1/primaryTopic"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/1999/02/22-rdf-syntax-ns#type"},"o":{"type":"uri","value":"http://dbpedia.org/class/yago/Object100002684"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutter"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageRedirects"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_microjet"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageRedirects"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#label"},"o":{"type":"literal","value":"Découpe laser","lang":"fr"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageExternalLink"},"o":{"type":"uri","value":"http://www.sparetimelabs.com/animato/animato/3003/3003by.html"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2002/07/owl#sameAs"},"o":{"type":"uri","value":"http://de.dbpedia.org/resource/Laserschneiden"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutters"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageRedirects"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/1999/02/22-rdf-syntax-ns#type"},"o":{"type":"uri","value":"http://dbpedia.org/class/yago/WikicatLasers"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_water_jet_cutters"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageRedirects"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#comment"},"o":{"type":"literal","value":"Cięcie laserowe stanowi nowoczesną metodę obróbki o podobnych parametrach wymiarowych jak klasyczna obróbka mechaniczna. Podstawowa różnica tkwi w stosowanym czynniku tnącym, który w przypadku cięcia laserowego stanowi gorący promień lasera oraz gaz techniczny o dużej czystości. W zależności od stosowanego urządzenia (przede wszystkim jego mocy) cięcie przeprowadza się na trzy sposoby: metodą spalania, stapiania lub sublimacji.Zastosowanie laserów w przemyśle","lang":"pl"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://purl.org/dc/terms/subject"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Category:Cutting_processes"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2002/07/owl#sameAs"},"o":{"type":"uri","value":"http://eu.dbpedia.org/resource/Laserraren_bidezko_ebaketa"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/1999/02/22-rdf-syntax-ns#type"},"o":{"type":"uri","value":"http://dbpedia.org/class/yago/Instrumentality103575240"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#label"},"o":{"type":"literal","value":"Laserschneiden","lang":"de"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/1999/02/22-rdf-syntax-ns#type"},"o":{"type":"uri","value":"http://dbpedia.org/class/yago/Device103183080"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/abstract"},"o":{"type":"literal","value":"Cięcie laserowe stanowi nowoczesną metodę obróbki o podobnych parametrach wymiarowych jak klasyczna obróbka mechaniczna. Podstawowa różnica tkwi w stosowanym czynniku tnącym, który w przypadku cięcia laserowego stanowi gorący promień lasera oraz gaz techniczny o dużej czystości. W zależności od stosowanego urządzenia (przede wszystkim jego mocy) cięcie przeprowadza się na trzy sposoby: metodą spalania, stapiania lub sublimacji. Zastosowanie laserów w przemyśle","lang":"pl"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageExternalLink"},"o":{"type":"uri","value":"http://www.thefabricator.com/LaserCutting/LaserCutting_ArticleList.cfm"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/1999/02/22-rdf-syntax-ns#type"},"o":{"type":"uri","value":"http://dbpedia.org/class/yago/Artifact100021939"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageExternalLink"},"o":{"type":"uri","value":"http://books.google.com/?id=6x1smAf_PAcC"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/abstract"},"o":{"type":"literal","value":"レーザ切断（レーザせつだん、英語: Laser cutting）とは、レーザーのエネルギーによって溶融、切断する加工法の総称。 レーザ発振器から反射鏡などを用いて伝送されてきたレーザーを集光レンズで細く絞って試料に照射することで局部的に溶融させ、レーザーと同軸に配置したノズルからアシストガスを噴き付けて、溶融物を噴き飛ばし、切断する。金属はもちろん、セラミックス、樹脂、複合材の切断も行うことができる。また、切断カーフが小さいので、精度の良い切断が可能である。 レーザーを用いた切断加工（穴あけ加工）は産業界で最も早くから取り入れられ、板金材の切断用として広く定着したレーザー加工法のひとつ。近年、より厚い板の切断の普及や高速化が進み、レーザー切断の加工範囲は更に広がっている。他のどの切断加工方法よりも、広範な種類の材料を自由な形に、高速・高精度で切断加工できることと、美しい仕上がりの実現できることで、幅広い産業で取り入れられている。","lang":"ja"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageExternalLink"},"o":{"type":"uri","value":"http://www.cocometalcraft.com/differences-between-waterjet-and-laser-cutting-in-sheet-metal"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2002/07/owl#sameAs"},"o":{"type":"uri","value":"http://wikidata.dbpedia.org/resource/Q593053"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://purl.org/dc/terms/subject"},"o":{"type":"uri","value":"http://dbpedia.org/resource/Category:Metalworking_cutting_tools"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#label"},"o":{"type":"literal","value":"Corte con láser","lang":"es"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2000/01/rdf-schema#comment"},"o":{"type":"literal","value":"Лазерная резка — технология резки и раскроя материалов, использующая лазер высокой мощности и обычно применяемая на промышленных производственных линиях. Сфокусированный лазерный луч, обычно управляемый компьютером, обеспечивает высокую концентрацию энергии и позволяет разрезать практически любые материалы независимо от их теплофизических свойств. В процессе резки, под воздействием лазерного луча материал разрезаемого участка плавится, возгорается, испаряется или выдувается струей газа.","lang":"ru"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://www.w3.org/2002/07/owl#sameAs"},"o":{"type":"uri","value":"http://yago-knowledge.org/resource/Laser_cutting"}},{"s":{"type":"uri","value":"http://dbpedia.org/resource/Laser_cutting"},"p":{"type":"uri","value":"http://dbpedia.org/ontology/wikiPageExternalLink"},"o":{"type":"uri","value":"http://books.google.com/books?id=P6Ta1MPiOM8C&pg=RA1-PA202"}}]}}