{"results":[{"uri":"http://dbpedia.org/resource/Architectural_design_competition","label":"Architectural design competition","description":"An architectural design competition is a special type of competition in which an organization or government body that plans to build a new building asks for architects to submit a proposed design for a building. The winning design is usually chosen by an independent panel of design professionals and stakeholders (such as government and local representatives).","refCount":149,"classes":[],"categories":[{"uri":"http://dbpedia.org/resource/Category:Architectural_design","label":"Architectural design"},{"uri":"http://dbpedia.org/resource/Category:Architectural_competitions","label":"Architectural competitions"}],"templates":[],"redirects":[]},{"uri":"http://dbpedia.org/resource/University_of_Toronto_Space_Design_Contest","label":"University of Toronto Space Design Contest","description":"The University of Toronto Space Design Contest, or UTSDC is an annual contest for high school students founded in 2003. Teams work together to develop a solution for a design challenge, set every year. The contest was founded to promote awareness of space exploration and development, as well as to excite students about new, creative applications of science, technology and engineering. The contest runs year long and ends in a Design Fair and Conference held on the University of Toronto's St.","refCount":3,"classes":[],"categories":[{"uri":"http://dbpedia.org/resource/Category:University_of_Toronto","label":"University of Toronto"}],"templates":[],"redirects":[]},{"uri":"http://dbpedia.org/resource/NASA_Space_Settlement_Contest","label":"NASA Space Settlement Contest","description":"The NASA Space Settlement Contest is an annual design competition for 6-12th grade students sponsored by the NASA Ames Research Center and the NSS. This contest is open to students ages eleven through eighteen from anywhere in the world. Individuals compete as individuals or part of a team in two categories, in teams of up to six students, and in teams of seven or more students.","refCount":2,"classes":[],"categories":[{"uri":"http://dbpedia.org/resource/Category:Space_colonization","label":"Space colonization"}],"templates":[],"redirects":[]},{"uri":"http://dbpedia.org/resource/Nebula_Design_Contest","label":"Nebula Design Contest","description":"Nebula : The Definitive Analog Design Contest is an All India analog design contest conducted annually by Cosmic circuits to promote interest in Analog Integrated Circuit design among under-graduate, graduate and doctoral students of Indian universities. Nebula is organized annually by Cosmic Circuits. Inaugural edition of Nebula saw huge media coverage and attracted more than 1500 participants from all over the country.","refCount":1,"classes":[],"categories":[{"uri":"http://dbpedia.org/resource/Category:Competitions_in_India","label":"Competitions in India"}],"templates":[],"redirects":[]},{"uri":"http://dbpedia.org/resource/International_Environmental_Design_Contest","label":"International Environmental Design Contest","description":"The International Environmental Design Contest (IEDC) is a competition hosted by the WERC Consortium and the Institute for Energy & the Environment at New Mexico State University. It is an annual event in which student teams prepare written, oral, poster, and bench-scale model presentations in response to design tasks. The student solutions are judged by industry and academic professionals. For an explanation of the contest tasks, awards, and a listing of participating teams, see below.","refCount":0,"classes":[],"categories":[{"uri":"http://dbpedia.org/resource/Category:Competitions","label":"Competitions"},{"uri":"http://dbpedia.org/resource/Category:Environmental_design","label":"Environmental design"},{"uri":"http://dbpedia.org/resource/Category:Articles_created_via_the_Article_Wizard","label":"Articles created via the Article Wizard"}],"templates":[],"redirects":[]}]}