{"results":[{"uri":"http://dbpedia.org/resource/Pacific_Time_Zone","label":"Pacific Time Zone","description":"The Pacific Time Zone observes standard time by subtracting eight hours from Coordinated Universal Time. The clock time in this zone is based on the mean solar time of the 120th meridian west of the Greenwich Observatory. During daylight saving time, its time offset is UTC−7. In the United States and Canada, this time zone is generically called Pacific Time (PT).","refCount":725,"classes":[],"categories":[{"uri":"http://dbpedia.org/resource/Category:Time_in_the_United_States","label":"Time in the United States"},{"uri":"http://dbpedia.org/resource/Category:Time_in_Canada","label":"Time in Canada"},{"uri":"http://dbpedia.org/resource/Category:Time_in_Mexico","label":"Time in Mexico"},{"uri":"http://dbpedia.org/resource/Category:Time_zones","label":"Time zones"}],"templates":[],"redirects":[]},{"uri":"http://dbpedia.org/resource/Time_zone","label":"Time zone","description":"A time zone is a region on Earth that has a uniform standard time for legal, commercial, and social purposes. It is convenient for areas in close commercial or other communication to keep the same time, so time zones tend to follow the boundaries of countries and their subdivisions. Most of the 40 time zones on land are offset from Coordinated Universal Time (UTC) by a whole number of hours (UTC−12 to UTC+14), but a few are offset by 30 or 45 minutes.","refCount":639,"classes":[],"categories":[{"uri":"http://dbpedia.org/resource/Category:Time_zones","label":"Time zones"}],"templates":[],"redirects":[]},{"uri":"http://dbpedia.org/resource/Atlantic_Standard_Time_Zone","label":"Atlantic Standard Time Zone","description":"The Atlantic Standard Time Zone (AST) is a geographical region that keeps time by subtracting four hours from Coordinated Universal Time, resulting in UTC-4. The clock time in this zone is based on the mean solar time of the 60th meridian west of the Greenwich Observatory. In Canada, the provinces of New Brunswick and Nova Scotia reckon time specifically as an offset of 4 hours from Greenwich Mean time.","refCount":94,"classes":[],"categories":[{"uri":"http://dbpedia.org/resource/Category:Time_zones","label":"Time zones"}],"templates":[],"redirects":[]},{"uri":"http://dbpedia.org/resource/Time_in_China","label":"Time in China","description":"Time in China follows a single standard time of UTC+08:00, which is 8 hours ahead of Greenwich Mean Time. China spans five different geographic time zones, from UTC+05:00 in the west to UTC+09:00 in the east, yet since 1949 China has only had a single standard time. The time UTC+06:00 is also used unofficially in Xinjiang and Tibet. Historically under the Republic of China it was divided into five time zones.","refCount":14,"classes":[],"categories":[{"uri":"http://dbpedia.org/resource/Category:Time_in_China","label":"Time in China"},{"uri":"http://dbpedia.org/resource/Category:Geography_of_the_People's_Republic_of_China","label":"Geography of the People's Republic of China"}],"templates":[],"redirects":[]},{"uri":"http://dbpedia.org/resource/IATA_code","label":"IATA code","description":"IATA codes are abbreviations that the International Air Transport Association (IATA) publishes to facilitate air travel. They are typically 1-, 2-, 3-, or 4-character combinations that uniquely identify locations, equipment, companies, and times to standardize international flight operations. All codes within each group follow a pattern (same number of characters, and using either all letters or letter/digit combinations) to reduce the potential for error.","refCount":11,"classes":[],"categories":[{"uri":"http://dbpedia.org/resource/Category:Encodings","label":"Encodings"},{"uri":"http://dbpedia.org/resource/Category:International_Air_Transport_Association","label":"International Air Transport Association"}],"templates":[],"redirects":[]}]}